[
  {
    "source": "girlonazebra",
    "url": "https://girlonazebra.com/things-to-do-in-siquijor/",
    "title": "8 Best Things to Do in Siquijor (Plus 2 I’d Skip): My Favorite Attractions in Siquijor 2025",
    "scraped_at": "2026-01-04T05:52:10.297700",
    "sections": [
      {
        "heading": "Introduction",
        "paragraphs": [
          "I’ve talked to a few people recently about Siquijor—whether it’s worth visiting, what the best things to do are, and how the island compares to other spots in the Philippines. And honestly, I’ve heard all kinds of opinions.",
          "After spending over a week on Siquijor Island myself, I’d say I checked off most of the top attractions and did nearly every activity that gets recommended online. So I feel like I have a pretty solid sense of what’s actually worth doing.",
          "Some friends weren’t totally sold on the island. A few of the tourist spots can feel a little overcrowded or hyped up, though to be fair, Siquijor is still way less touristy than places like Bohol or Cebu.",
          "So, to clear up the confusion a bit, I’m putting together this list based on my own experience: the best things to do in Siquijor, what I really enjoyed, and a couple of activities I honestly think you can skip."
        ]
      },
      {
        "heading": "In a Rush? Here Are Our Favorite Hotels in Siquijor Philippines",
        "paragraphs": [
          "⭐️⭐️⭐️ Coco Grove Beach Resort – Click here for rates & availability",
          "⭐️⭐️Nakabalo Guesthouse – Click here for rates & availability",
          "⭐️Mandala Tribe Treehouses – Click here for rates & availability"
        ]
      },
      {
        "heading": "Top Things to Do in Siquijor – My Experience",
        "paragraphs": [
          "After spending just over a week on Siquijor, I feel like I got a pretty good feel for the island and most of the best things to do in Siquijor. I didn’t go scuba diving, but aside from that, I managed to visit most of the major attractions in Siquijor and even a few lesser-known spots too.",
          "Just a heads-up: I was there during Holy Week in April, and it was wild. Power would cut out randomly multiple times a day, the ferries were packed, and hotels were fully booked across the island. So while I had a great time, I also know that Siquijor might feel totally different if you visit at a quieter time of year. Keep that in mind.",
          "I had a scooter for my entire stay, which I definitely recommend. It just gave me all the freedom I needed to explore with no need to wait for tuk-tuks or book tours. I could stop by waterfalls in the morning, go back for a shower in the afternoon, then head to the beach for sunset. That flexibility made a big difference.",
          "What I loved most about Siquijor was how local and low-key it felt, even during one of the busiest weeks of the year. It didn’t have that polished, overly curated vibe that you sometimes get in places like Cebu or Bohol. It felt more real. More relaxed. And honestly, I barely saw any other international tourists while I was there.",
          "Some of my top spots were Cambugahay Falls was a clear favorite. One of the prettiest waterfalls I’ve ever seen, and the rope swings there are just ridiculously fun. I also really loved Pitogo Cliff, there’s something about that spot that reminded me of the Mediterranean. Calm blue water, limestone cliffs and barely anyone around."
        ]
      },
      {
        "heading": "1. Cambugahay Falls",
        "paragraphs": [
          "Cambugahay Falls was hands down my favorite activity in Siquijor. We drove there on our scooter early in the morning at around 8 or 9 AM from San Juan, which took about an hour. The entrance fee was 100 pesos per person, plus another 50 pesos for unlimited rope swing jumps (which I definitely recommend, don’t be stingy, that’s less than $1).",
          "The waterfall itself was stunning. Bright turquoise water, multiple levels and pools, and when we arrived, it wasn’t crowded at all. We had space to swim, jump, and hang out without feeling rushed or packed in. It’s cheap, it’s fun, and if you come early, you’ll beat the tour groups. This one’s a must in my opinion."
        ]
      },
      {
        "heading": "2. Pitogo Cliff",
        "paragraphs": [
          "Pitogo Cliff Nature Park, I feel like I say this every time I talk about it, but I don’t care,it seriously reminds me of the Mediterranean, if you look at it from the right angle. The cliffs, the calm blue water… it’s just stunning.",
          "When I went, I didn’t expect much. It was just a random stop on the way back from Cambugahay Falls, but I’m so glad we pulled over. Entrance was only 30 pesos, and you get to jump off a little platform, swim in that crazy-clear ocean water, and take some really pretty photos. I definitely recommend it.",
          "It’s not a full-day activity or anything. If you’re swimming and hanging out, you might spend 30 to 40 minutes here. If you’re just stopping for a quick photo, you’ll be done in five. Either way, it’s worth it."
        ]
      },
      {
        "heading": "3. Snorkeling at Tubog Marine Sanctuary",
        "paragraphs": [
          "One thing that really surprised me was how fun the snorkeling was at Tubod Marine Sanctuary. It’s right in San Juan, just next to Coco Grove Beach Resort, you know, the big orange luxury hotel you’ve probably driven past at some point.",
          "There’s a little parking area off the main road where you can leave your scooter. From there, it’s just a short walk down a driveway to the beach. You’ll pay a 100-peso entrance fee, and you can either rent snorkel gear or bring your own. Super cheap, super easy.",
          "What I loved most is that you don’t need a tour or boat or anything, you just walk straight into the ocean and you’re surrounded by coral, colorful fish, and if you’re lucky, even turtles. Definitely worth a stop if you’re staying nearby."
        ]
      },
      {
        "heading": "4. Cliff Diving at Salagdoong Beach",
        "paragraphs": [
          "Salagdoong Beach, on the east coast of Siquijor, is super popular for cliff diving. There are two different platforms at two different heights, and I had a great time jumping off both. That said, I’ve heard mixed reviews, some people think the beach itself isn’t that nice (a bit dirty), and the drive is pretty long (over an hour from San Juan).",
          "Personally, I thought it was a fun experience, but I wouldn’t call it a must-see. If you’re excited about cliff diving and want a bit of an adventure, go for it. But if you’re tight on time or just want to relax, this might be one to skip."
        ]
      },
      {
        "heading": "5. Visiting a Healer",
        "paragraphs": [
          "Visiting a healer in Siquijor is something I wouldn’t recommend to everyone. It’s a very spiritual and cultural experience, and you should only go if you’re genuinely open to it and willing to respect the traditions of the local people. Siquijor is known for its folklore, and many locals still believe in healing the body and soul, witchcraft, and even demons roaming the island at night.",
          "The experience gave me a unique look into a side of Filipino culture I hadn’t seen anywhere else in the country. If you’re curious, ask your hotel or homestay owner, they can help arrange a visit with a local driver who knows where to go. And just so you know, this isn’t some wild ayahuasca trip, there are no drugs involved. It’s usually a smoke ceremony or a healing massage."
        ]
      },
      {
        "heading": "6. Sunset at Nakabalo Pool",
        "paragraphs": [
          "I had such a fun day at Nakabalo Guesthouse. It’s a little homestay, restaurant, and bar located in the hills above San Juan, but the real highlight is the infinity pool overlooking Siquijor and the ocean. The view is incredible, especially at sunset.",
          "We pretty much spent the whole day there. It’s a bit pricey at 1,000 pesos per person for a poolside sunbed, but 600 of that goes toward food and drinks, so you can easily make a day of it—swim, eat, have a few drinks, and catch the sunset. If your accommodation already has a nice pool, maybe this is not a must-do. But if it doesn’t, this is a great little splurge and cool way to spend the day."
        ]
      },
      {
        "heading": "7. Paliton Beach",
        "paragraphs": [
          "Paliton Beach was for sure my favorite beach in Siquijor. We went there multiple times, it’s only a few minutes from San Juan by scooter, and the water is so clear it looks like a swimming pool. Soft white sand, palm trees, and just a laid-back vibe that makes you want to hang around all afternoon and stay for sunset.",
          "One thing to note though: the tides make a big difference. It’s not quite like Siargao where the sea completely disappears at low tide, but it does get super shallow to the point where swimming isn’t really possible. You can still sit in the water and cool off, but don’t expect to do laps.",
          "Also, when you arrive at the scooter parking lot, don’t stop at the small stretch of sand you first see. Keep walking through the trees along the little path and it’ll lead you to the much bigger and prettier part of the beach. Trust me, it’s worth the extra two minutes."
        ]
      },
      {
        "heading": "8. Pizza at Dolce Amore",
        "paragraphs": [
          "Okay, this isn’t really an activity, but I’m putting it in here anyway because it was genuinely one of the best meals I had in the Philippines. Dolce Amore is a little Italian-run spot in Siquijor and the pizza here is ridiculously good. Like, proper Neapolitan-style pizza with burrata and spicy salami and all the good stuff. The owners are Italian and import most of the ingredients straight from Italy, so it’s the real deal.",
          "We had the spicy burrata pizza and the bruschetta and I was honestly shocked at how good it was. It’s a little pricier than your average meal in Siquijor, but totally worth it for a date night or just a treat-yourself dinner.",
          "One tip: try to get there early, around 5 PM if you can. They don’t take reservations (as far as I know), and the line gets long fast."
        ]
      },
      {
        "heading": "Two Things I Thought Weren’t Worth It",
        "paragraphs": [
          "As much as I loved Siquijor, there were a couple of things I did that I probably wouldn’t recommend. I didn’t feel scammed or anything like that—they just didn’t feel worth the time or effort compared to everything else the island has to offer."
        ]
      },
      {
        "heading": "Visit the Old Enchanted Balete Tree",
        "paragraphs": [
          "I know this spot shows up on pretty much every Siquijor itinerary, but personally, I wouldn’t go out of my way for it. It’s basically just a big old balete tree with a little fish spa underneath, like the kind you see at night markets. Cool if you’ve never done it before, but to be honest, it just felt a bit…meh. The whole thing took about five minutes, and I left thinking, that’s it?",
          "If you happen to be driving past it anyway and feel like a quick stop, fine. But I wouldn’t plan around it or call it a must-see. There’s way better stuff to do on the island."
        ]
      },
      {
        "heading": "Visit the Butterfly Sanctuary",
        "paragraphs": [
          "This one also didn’t do it for me. It’s a small greenhouse with a few butterflies flying around and a 100-peso entrance fee that felt a bit steep for what you get. Maybe it’s meant to support conservation or something (which I’d totally be on board with), but the whole place just had this weird tourist trap vibe to it.",
          "We walked around for maybe ten minutes and that was kind of it. If you’re into butterflies or looking to fill a super quiet day, maybe it’s your thing. But otherwise, I’d say skip it and use your time for something more exciting, like literally anything else on this list."
        ]
      },
      {
        "heading": "Final Thoughts on My Travel Guide for the Best Siquijor Attractions",
        "paragraphs": [
          "Overall, I had such a good time in Siquijor. Even though I visited during Holy Week (aka absolute chaos), I still managed to enjoy so much of what the island has to offer. From waterfalls and cliff dives to laid-back beach days and local food spots, Siquijor really surprised me. It felt more local and relaxed than other places I visited in the Philippines, and honestly, that’s what made it so special.",
          "Just rent a scooter, take it slow, and do whatever feels good that day. You don’t need a packed itinerary here—some of my favorite moments came from just pulling over somewhere random. Siquijor is the kind of place where the small stuff ends up being the most memorable."
        ]
      },
      {
        "heading": "Check Out My Other Siquijor Guides",
        "paragraphs": [
          "Siargao or Siquijor: Siargao vs. Siquijor My Ultimate Comparison",
          "Cafes in Siquijor: My 6 Best Cafes in Siquijor",
          "Restaurants in Siquijor: My Top 9 Siquijor Restaurants",
          "Best Time to Visit Siqujor: When is the best time to visit Siquijor",
          "How to Get to Siquijor: How to Get to Siquijor Travel Guide",
          "Cambugahay Falls Siquijor: My Cambugahay Falls Travel Guide",
          "Is Siquijor Worth Visiting: Is Siquijor Worth Visiting My Honest Review",
          "Siquijor Beaches: The Best Beaches in Siquijor",
          "Digital Nomad in Siquijor: Remote Work in Siquijor, Is it Possible?",
          "Pitogo Cliff: Is Pitogo Cliff Siquijor Worth Visiting?",
          "Siquijor Itinerary: My 3 Days in Siquijor Itinerary",
          "Siquijor Hotels: Where to Stay in Siquijor Island",
          "Paliton Beach: My Quick Guide to Paliton Beach Siquijor",
          "Siquijor Resorts: The Best Beach Resorts in Siquijor Philippines",
          "Siquijor Travel Guide: My Siquijor Island Philippines Travel Guide",
          "Best eSIM for Asia: My Honest Review",
          "Best eSIMs for Traveling Asia: My Top 4 eSIMs"
        ]
      },
      {
        "heading": "My Complete Philippines Travel Guide: Everything You Need to Know Before Visiting in 2025",
        "paragraphs": [
          "The Philippines was one of my biggest destinations this year. I spent almost three months there, living, working as a digital nomad, and exploring as much of the country as I could, and it’s definitely earned a special place in my heart. It’s for sure one of the most beautiful countries I’ve seen so far.…"
        ]
      },
      {
        "heading": "My Perfect 2 Week Philippines Itinerary: What I Did & Loved in This Island Paradise",
        "paragraphs": [
          "The Philippines is without a doubt one of the most beautiful countries in Southeast Asia, maybe even the world.  I’m sure you’ve seen all those photos of palm trees, sandbars, incredible white sand beaches, and towering limestone cliffs. And yes, it really does look like that. But with over 7,000 islands, figuring out where to…"
        ]
      },
      {
        "heading": "My Ultimate Balabac Palawan Travel Guide: What I Loved & Everything You Need to Know (2025)",
        "paragraphs": [
          "Balabac is a group of small, remote islands in the far south of Palawan and honestly, it’s one of my favorite places in the Philippines. The islands I visited on that trip were absolutely stunning: untouched, remote, lined with palm trees, white sand, and amazing turquoise waters. I spent four days exploring the area, and…"
        ]
      }
    ]
  },
  {
    "source": "jonnymelon",
    "url": "https://www.jonnymelon.com/siquijor-tourist-spots/",
    "title": "15 BEST Siquijor Tourist Spots: 2026 Travel Guide",
    "scraped_at": "2026-01-04T05:53:33.990624",
    "sections": [
      {
        "heading": "Introduction",
        "paragraphs": [
          "Looking for the best Siquijor tourist spots? This is the only guide you’ll need to plan the perfect trip!",
          "Siquijor Island in the Philippines is a mystical paradise with many awesome things to do in Siquijor, including epic waterfalls, white sand beaches, iconic landmarks, awesome cliff jumps, and much more!",
          "If you’re an outdoor enthusiast, you’ll be spoiled for adventures to add to your list of must-see tourist spots in Siquijor!",
          "Commonly referred to as the ‘Isla del Fuego’ or ‘the island of fire’, it’s widely known for its witchcraft, healers, and spiritual rituals, which are not something that you come across every day.",
          "As spooky as this sounds, there is no need to be alarmed, as Siquijor is a completely safe and normal island in the Philippines.",
          "In this post, I have put together the ultimate guide to the 15 Best Tourist Spots in Siquijor and other useful information on how to get here, where to stay, how to get around, and the best time to visit!",
          {
            "type": "list",
            "items": [
              "SIQUIJOR TOURIST SPOTS – OVERVIEWWHERE IS SIQUIJOR ISLAND?HOW TO GET TO SIQUIJOR?WHERE TO STAY IN SIQUIJOR?HOW TO GET AROUND THE TOURIST SPOTS IN SIQUIJOR?BEST TIME TO VISIT SIQUIJOR?",
              "WHERE IS SIQUIJOR ISLAND?",
              "HOW TO GET TO SIQUIJOR?",
              "WHERE TO STAY IN SIQUIJOR?",
              "HOW TO GET AROUND THE TOURIST SPOTS IN SIQUIJOR?",
              "BEST TIME TO VISIT SIQUIJOR?",
              "15 BEST TOURIST SPOTS IN SIQUIJOR1. PALITON BEACH2. CAMBUGAHAY FALLS3. SALAGDOONG BEACH & CLIFF JUMP4. CENTURY-OLD BALETE TREE5. LUGNASON FALLS 6. VISIT THE LAZI CHURCH7. QUISOL MOUNTAIN VIEW8. LAGAAN FALLS9. MAN-MADE FOREST SIQUIJOR10. TALISAY BEACH11. DAY TRIP TO APO ISLAND12. TUBOD MARINE SANCTUARY13. BUTTERFLY SANCTUARY14. LOCONG FALLS15. CANGBANGAG FALLS",
              "1. PALITON BEACH",
              "2. CAMBUGAHAY FALLS",
              "3. SALAGDOONG BEACH & CLIFF JUMP",
              "4. CENTURY-OLD BALETE TREE",
              "5. LUGNASON FALLS",
              "6. VISIT THE LAZI CHURCH",
              "7. QUISOL MOUNTAIN VIEW",
              "8. LAGAAN FALLS",
              "9. MAN-MADE FOREST SIQUIJOR",
              "10. TALISAY BEACH",
              "11. DAY TRIP TO APO ISLAND",
              "12. TUBOD MARINE SANCTUARY",
              "13. BUTTERFLY SANCTUARY",
              "14. LOCONG FALLS",
              "15. CANGBANGAG FALLS",
              "FINAL THOUGHTS – SIQUIJOR TOURIST SPOTS"
            ]
          },
          {
            "type": "list",
            "items": [
              "WHERE IS SIQUIJOR ISLAND?",
              "HOW TO GET TO SIQUIJOR?",
              "WHERE TO STAY IN SIQUIJOR?",
              "HOW TO GET AROUND THE TOURIST SPOTS IN SIQUIJOR?",
              "BEST TIME TO VISIT SIQUIJOR?"
            ]
          },
          {
            "type": "list",
            "items": [
              "1. PALITON BEACH",
              "2. CAMBUGAHAY FALLS",
              "3. SALAGDOONG BEACH & CLIFF JUMP",
              "4. CENTURY-OLD BALETE TREE",
              "5. LUGNASON FALLS",
              "6. VISIT THE LAZI CHURCH",
              "7. QUISOL MOUNTAIN VIEW",
              "8. LAGAAN FALLS",
              "9. MAN-MADE FOREST SIQUIJOR",
              "10. TALISAY BEACH",
              "11. DAY TRIP TO APO ISLAND",
              "12. TUBOD MARINE SANCTUARY",
              "13. BUTTERFLY SANCTUARY",
              "14. LOCONG FALLS",
              "15. CANGBANGAG FALLS"
            ]
          }
        ]
      },
      {
        "heading": "SIQUIJOR TOURIST SPOTS – OVERVIEW",
        "paragraphs": [
          "Let’s start this guide with all the essentials you should know about Siquijor."
        ]
      },
      {
        "heading": "WHERE IS SIQUIJOR ISLAND?",
        "paragraphs": [
          "Siquijor Island is located in the Central Visayas region of the Philippines.",
          "It’s very close to the neighboring islands of Cebu, Bohol, and Dumaguete, and can be easily reached by plane or ferry.",
          "Click here to see the location on Google Maps and check the best Siquijor tourist spots map."
        ]
      },
      {
        "heading": "HOW TO GET TO SIQUIJOR?",
        "paragraphs": [
          "There are two ways to get here, one is by plane and the other by ferry.",
          "There are weekly flights to Siquijor connecting domestic travelers coming from Manila, Cebu, and Dumaguete.",
          "One of the most common routes is the ferry from Dumaguete to Siquijor, which takes approximately 1.5 hours and the cost is around 500-600 pesos, depending on the star rating of the ferry. There is also an additional 20 pesos terminal fee.",
          "Daily ferries are departing from Dumaguete Port in Negros Oriental and arriving at Larena Port in Siquijor.",
          "If you happen to be in the very south of Cebu and heading to Siquijor from here, there is only one ferry departure per day, leaving from Liloan Port in Cebu at 10 am, bound for Larena Port in Siquijor. The ferry from Cebu to Siquijor takes approximately 1-2 hours and the cost is around 200 pesos.",
          "You can purchase your tickets at the Liloan Port at least one hour before departure.",
          "The ferry from Bohol to Siquijor is another common route for travelers and this is the exact route that I took. The cost for this journey is around 900 pesos plus an additional 20 pesos terminal fee.",
          "Daily ferries depart from Tagbilaran Port in Bohol around 10 am and it takes approximately 2 hours to reach Larena Port in Siquijor."
        ]
      },
      {
        "heading": "WHERE TO STAY IN SIQUIJOR?",
        "paragraphs": [
          "Siquijor has hundreds of accommodation options to choose from, so I have narrowed it down to a few of the best places to stay to fit the needs of budget backpackers, luxury travelers, and everyone in between."
        ]
      },
      {
        "heading": "HOW TO GET AROUND THE TOURIST SPOTS IN SIQUIJOR?",
        "paragraphs": [
          "There are a couple of options for getting around the island and enjoying Siquijor what to do, and they are by scooter, habal habal, tricycle, or Jeepney.",
          "You can rent a scooter for as little as 250 pesos per day and make your own way around the island at your own pace.",
          "When you arrive on the island by ferry, you’ll find that there are half a dozen scooter rental stores located at the Larena ferry terminal, which is super convenient. You can pick up a set of wheels for the time you plan to spend on the island.",
          "If you are not confident driving a scooter, the other option is to hail down a Jeepney, tricycle, or habal habal (motorbike taxi) along the main road in Larena and get a ride to San Juan, the main tourist hub on the island.",
          "The cost depends on how good your bartering skills are, though a 40-minute drive from Larena to San Juan in a Jeepney should be around 100 pesos, in a tricycle 500 pesos, and habal-habal 350 pesos.",
          "We all know accidents can happen and having Heymondo Insurance will save you thousands of dollars if something goes wrong.",
          "Heymondo offers low-cost Travel Insurance to keep you covered on all your adventures."
        ]
      },
      {
        "heading": "BEST TIME TO VISIT SIQUIJOR?",
        "paragraphs": [
          "The best time to visit Siquijor, weather-wise, is between April and July when temperatures are hot and there is barely any rainfall. This is also high season, so expect to see many tourists during these months.",
          "I recommend visiting the tourist spots in Siquijor on the shoulder months of the high season, between November and March, which sees a bit of rainfall but usually only lasts for a couple of hours and the rest of the day is sunny.",
          "Try to avoid the typhoon season, which is between August and October."
        ]
      },
      {
        "heading": "15 BEST TOURIST SPOTS IN SIQUIJOR",
        "paragraphs": [
          "Now that you’ve got all the information on how to get here, where to stay, the best time to visit, and all the logistics, let’s get to the fun stuff!",
          "So without further ado, here is the ultimate guide to the 15 Best Siquijor Tourist Spots!"
        ]
      },
      {
        "heading": "1. PALITON BEACH",
        "paragraphs": [
          "The first thing that should be at the top of your list of things to do is to hit the beach! Paliton Beach is rated as one of the best beaches in Siquijor for its glistening white sands and palm tree-fringed shoreline.",
          "This is one tourist spot in Siquijor you do not want to miss!",
          "Paliton Beach is located in the main tourist area of San Juan. Most accommodations are dotted along the main road in San Juan, so no doubt Paliton Beach will be within walking distance from your hotel.",
          "Paliton Beach faces west, making it the perfect spot to watch the sunset on the sand with your mates!",
          "There are a few oceanside cafes and beach bars dotted along Paliton Beach serving up cold brews and delicious meals. Most usually have happy hour between 4 pm and 6 pm, so make sure to get there around this time if you want to score some cheap drinks.",
          "If you visit Paliton Beach during the day, it’s just as good. You can find several tree swings tied to bent palms that you can swing out over the water’s edge!",
          "Apart from that, there isn’t a whole lot more to do on Paliton Beach other than going swimming in the ocean, lying in a hammock underneath the coconut palms, or reading a book by the beach.",
          "Paliton Beach really is the best beach on the island and I highly recommend adding this epic spot to your itinerary."
        ]
      },
      {
        "heading": "2. CAMBUGAHAY FALLS",
        "paragraphs": [
          "Cambugahay Falls is arguably the best waterfall on the island! Cambugahay Falls is most famous for its tiered levels and freshwater cascades that are surrounded by lush rainforest, which is why it’s one of the most popular tourist spots in Siquijor!",
          "Cambugahay Falls is located in Lazi, which is approximately a 30-minute drive from San Juan to reach the falls and the entrance fee is 20 pesos. You may also have to pay a donation fee for parking.",
          "From the jump-off point, it takes around 5 minutes to walk down a set of concrete steps to reach the first level of Cambugahay Falls. This epic location features a large natural swimming hole and some man-made structures, including rope swings, bamboo rafts, and a wide set of falls.",
          "Besides the bottom swimming hole, there are a few more levels of Cambugahay Falls to explore.",
          "Follow the trail upstream and across the bamboo bridges, where you will find more freshwater swimming holes, flowing rock pools, and several cliff jumping spots."
        ]
      },
      {
        "heading": "3. SALAGDOONG BEACH & CLIFF JUMP",
        "paragraphs": [
          "Wondering what to do in Siquijor? Salagdoong Beach is hands down one of the best beaches on the island, which is most popular for snorkeling around the colorful reefs, relaxing on the secluded beaches, and epic cliff jumping!",
          "I highly recommend adding Salagdoong Beach to your list of best things to do in Siquijor!",
          "Salagdoong Beach is attached to Salagdoong Beach Resort on the far east corner of the island in the town of Maria.",
          "From San Juan, it’s approximately a 50-minute drive to reach Salagdoong Beach and the entrance fee is 50 pesos per person plus an additional 20 pesos for parking.",
          "Salagdoong Beach boasts two beautiful coves lined with coconut palms and white sand shorelines. Just off the shore is a colorful reef that is great for snorkeling and swimming.",
          "I would have to say the slippery slide and cliff jumping at Salagdoong Beach is the main attraction and one for thrill-seekers! Make sure you visit during high tide to do these activities.",
          "There are two diving boards here, one is around 5 meters and the other is 10 meters. Jumping from the top of the cliff into the turquoise waters below is one of the most adrenaline-fuelled activities to do during your visit.",
          "If you’re on the hunt for a professional camera for traveling, check out the Canon G7 X Mark II.",
          "This tiny camera fits in your pocket, captures high-quality photos and videos, and has Wi-Fi so you can instantly transfer to your phone!"
        ]
      },
      {
        "heading": "4. CENTURY-OLD BALETE TREE",
        "paragraphs": [
          "The century-old Balete Tree is one of the most visited tourist spots on the island and it’s easy to see why!",
          "This Siquijor tourist spot is located in Lazi on the south coast of Siquijor Island Philippines. From San Juan, it’s approximately a 20-minute drive and the entrance fee is only 10 pesos.",
          "The 400-year-old Enchanted Balete Tree has a very mystical and spiritual background. It’s a place that local shamans use for sacred rituals. However, I didn’t see any witchcraft when I visited.",
          "At the base of the Century Old Balete Tree is a small freshwater pond filled with fish that will nibble the dead skin off the soles of your feet if you dip them in.",
          "Enjoy your fish foot spa while marveling at the thick canopy and huge vines that hang from the Old Enchanted Balete Tree.",
          "Next to the Century Old Tree is a two-story restaurant where you can grab a meal with drinks and also a souvenir store selling all sorts of gifts. All in all, it’s one of the best places to consider when planning where to go in Siquijor!"
        ]
      },
      {
        "heading": "5. LUGNASON FALLS",
        "paragraphs": [
          "Lugnason Falls, also known as Zodiac Falls, is up there with one of the top waterfalls in Siquijor that I highly recommend adding to your itinerary!",
          "Lugnason Falls is located in the main tourist area of San Juan. From Paliton Beach, it’s approximately a 15-minute drive inland from the coast. The entrance is free, though you may be asked to pay a small parking fee of 10 pesos.",
          "From the jump-off point, it takes around 15 minutes to walk along a dirt trail through the forest to reach Lugnason Falls.",
          "Lugnason Falls features a 5-meter waterfall and a large spring filled with blue Gatorade-colored water. It’s an adventurer’s playground and reminded me of the blue-ass water that I found at Kawasan Falls in Cebu.",
          "Lugnason Falls is a great spot to hang out and go swimming under the falls to cool off. For thrill-seekers, jumping from the top of the falls into the catch basin below is a lot of fun, too!",
          "Don’t end the adventure here, as there are more unique spots to be found in the same valley as Lugnason Falls. Follow the jungle trail downstream where you will find man-made aqua ducts and an epic cold spring perfect for swimming!",
          "Can you think of better things to do Siquijor?!",
          "Need a place to stay? Aloha Seaside Resort is conveniently located in Siquijor.",
          "Whether you’re here to explore around or relax in comfort, Aloha Seaside Resort is an excellent option!"
        ]
      },
      {
        "heading": "6. VISIT THE LAZI CHURCH",
        "paragraphs": [
          "Lazi Church, also known as San Isidro Labrador Parish Church, is the island’s oldest, largest, and most significant Roman Catholic Church.",
          "San Isidro Labrador Parish Church is located in Lazi on the island’s south coast. From San Juan, it’s approximately a 20-minute drive",
          "The construction of Lazi Church was completed in 1884 and was built mainly with stone and hardwood. The bell tower attached to one side of the church was built one year later, the most dominant feature on the outside.",
          "Next to the church, you can also find a silent convent that acts as a museum that holds many old artifacts and antiques. The entrance fee at the museum is around 20 pesos.",
          "Lazi Church is also home to large masses, and it’s possible to take a tour inside this century-old church with a priest."
        ]
      },
      {
        "heading": "7. QUISOL MOUNTAIN VIEW",
        "paragraphs": [
          "Quisol Mountain View boasts one of the best panoramic viewpoints, which overlooks the island and its pristine coastlines! This epic viewpoint is an off-the-beaten-path adventure that is easy to find and far away from the crowds that you will find at other Siquijor tourist spots.",
          "Quisol Mountain View is located at the top of the hill between Lazi and Larena. It is approximately a 40-minute drive from San Juan to Quisol Mountain View.",
          "Here is the exact location on Google Maps.",
          "There is no official parking lot or tourist desk at this location, so you will have to park your scooter on the side of the road and find the entry point, which isn’t too hard to find.",
          "You will see a large sign with the words ‘Quisol Mountain View’ written on it and make-shift stairs cut into the land leading up to the viewpoint. See the image below for reference.",
          "It takes around 5 minutes to walk to the top of the mountain and you’ll be rewarded with extensive views of the island.",
          "Unfortunately, it was a bit cloudy on the day I visited, but on a nice clear day, you will be able to see the neighboring islands of Cebu, Negros, and Bohol.",
          "Get off the typical tourist trail and add the Quisol Mountain View to your list of things to do in Siquijor!",
          "The DJI Mini 3 Pro is the most affordable, user-friendly drone camera suitable for all levels!",
          "This travel-sized drone captures 4K/60fps video, 48MP photo, and has 34 minutes flight time."
        ]
      },
      {
        "heading": "8. LAGAAN FALLS",
        "paragraphs": [
          "Lagaan Falls is another one of the best waterfalls on the island and a must-visit. Swimming holes, rope swings, rock jumps, and small caves are just some of the things you can expect to find at this epic Siquijor tourist spot!",
          "Lagaan Falls is located in Lazi on the south coast of the island. From the main tourist area of San Juan, it’s approximately a 30-minute drive to reach Lagaan Falls.",
          "The Lagaan Falls entrance fee is 50 pesos and parking is free. At the entrance, local guides will offer to take you down to the falls, but this is not necessary as the trail is clearly marked.",
          "However, I visited these falls on my own and decided to take a guide for good company and tipped him 100 pesos at the end.",
          "It takes around 15 minutes to walk along a dirt trail underneath a dense rainforest canopy to reach the first level of this waterfall.",
          "Some of the features you will find here are a large swimming hole, rope swings, small caves, rock jumps, and a wide set of falls.",
          "Don’t forget to follow the jungle trail upstream, where you will find small freshwater rock pools and natural jacuzzis. You could easily spend a few hours here jumping from pool to pool, swinging from the tree swings, and not getting bored.",
          "The lush jungle surrounding Lagaan Falls makes this place so tranquil, and I highly recommend adding this spot to your list of things to see in Siquijor."
        ]
      },
      {
        "heading": "9. MAN-MADE FOREST SIQUIJOR",
        "paragraphs": [
          "The Man-Made Forest is similar to the Bilar Man-Made Forest in Bohol, though on a smaller scale. A visit to this tourist spot is worthy of a quick stop for a photo during your adventures around the island.",
          "The man-made forest can be found in Maria on the southeastern corner of the island. From San Juan, it is approximately a 45-minute drive.",
          "This enchanting stretch of road is around 2 km long and lined with beautiful mahogany trees between the towns of Minalulan and Liloan.",
          "When you enter this parallel tunnel of trees, you’ll feel like you’ve just entered another realm. You will also notice the temperature drop drastically as you drive through the man-made forest because the canopy above almost completely cuts out the sun.",
          "I recommend stopping by the man-made forest on your way to Salagdoong Beach, another of the places to visit in Siquijor."
        ]
      },
      {
        "heading": "10. TALISAY BEACH",
        "paragraphs": [
          "Talisay Beach is not as crowded and popular as Paliton Beach, which is why you should definitely find the time to visit this underrated destination.",
          "Talisay Beach can be found between Lazi and Maria, which is also in the same direction as Salagdoong Beach.",
          "There is no official entry point for Talisay Beach, you can park your scooter on the side of the road and follow one of the dirt trails down to the shoreline.",
          "Emerging out of the jungle trail, you’ll step foot onto a white sand and coral cove that is stunning, to say the least.",
          "Talisay Beach is best visited on high tide when the water comes right up to the palm-fringed shoreline, making it easier to go for a swim. At low tide, you will have to walk across the rocky reef to find deeper water for a refreshing dip.",
          "Talisay Beach is also a renowned spot for snorkeling, so make sure to bring a mask and snorkel set with you down to the beach."
        ]
      },
      {
        "heading": "11. DAY TRIP TO APO ISLAND",
        "paragraphs": [
          "Apo Island is a volcanic island located 30km off Siquijor’s southern coastline. Notorious for its dive sites and snorkeling, an Apo Island day trip is one of the top-rated things to do!",
          "To book an Apo Island Tour you can pop into one of the many dive shops and resorts located along Paliton Beach in San Juan and organize your trip through them at least one day in advance.",
          "A barbecue lunch and cold refreshments are usually included with the Apo Island tour.",
          "Apo Island has been the longest-lasting community-led marine protected area in the Philippines since 1986.",
          "Apo Island is so aesthetically pleasing to the eyes that you won’t want to close them! We anchored up the boat on the outer edge of the reef near the main beach port of Apo Island.",
          "Shortly after anchoring, we all jumped off the side of the boat and were snorkeling with turtles in no time!",
          "The Apo Island tour is an entire day of snorkeling with sea turtles, fish, sea snakes, and hundreds of colorful corals. There are also a few small mountain peaks on Apo Island that you can hike.",
          "I’m sure y’all know by now that GoPro’s are arguably the best action cameras on the planet!",
          "The new GoPro HERO 11 boasts 5.3K video, 27MP photo, HyperSmooth stabilization, and waterproof up to 10m!"
        ]
      },
      {
        "heading": "12. TUBOD MARINE SANCTUARY",
        "paragraphs": [
          "Tubod Marine Sanctuary is a protected reef, making it one of the best snorkeling and dive sites on Siquijor Island.",
          "Tubod Marine Sanctuary can be found in front of Coco Grove Resort and just off the shore of Tubod Beach in San Juan. From Paliton Beach, it’s approximately a 10-minute drive to reach Tubod Marine Sanctuary.",
          "Colorful corals and an abundance of marine life flourish within this protected marine sanctuary, so you are in for a real treat!",
          "You can bring your own mask and snorkel with you, or rent one from the resort, and it’s a short distance swim out to the reef.",
          "There are minimal currents and waves at Tubod Marine Sanctuary and the waters are incredibly clear. I recommend setting aside at least one hour of your day to enjoy this epic location."
        ]
      },
      {
        "heading": "13. BUTTERFLY SANCTUARY",
        "paragraphs": [
          "A new tourist spot in Siquijor is the beautiful butterfly sanctuary.",
          "The Butterfly Sanctuary is located close to the highest point on the island at Cang-apa village between Lazi and Larena. From San Juan, it is approximately a 40-minute drive.",
          "The butterfly park is run by a local man who welcomes guests to walk around the gardens and interact with the butterflies and other bugs inside his sanctuary.",
          "It’s worth a quick stop to have a poke around and grab a fresh buko (coconut) before continuing on to the next spot!",
          "You can also visit the Quisol Mountain Viewpoint, which is right around the corner from the butterfly sanctuary."
        ]
      },
      {
        "heading": "14. LOCONG FALLS",
        "paragraphs": [
          "Nestled in the southern part of Siquijor Island, this waterfall offers a refreshing swimming spot for a small entrance fee of 50 pesos.",
          "Once you get there, you’ll be greeted by a guide, which is optional, but I recommend supporting the local community.",
          "Plus, he knows his way around the area, so you stay safe with an expert.",
          "These Siquijor Falls aren’t very high but beautiful nonetheless, and there’s even a rope for you to swing and make the most of your time.",
          "Overall, this spot provides a peaceful and secluded location for a refreshing swim in the natural beauty of Siquijor, and you can stop here on the way to Cambugahay Falls!"
        ]
      },
      {
        "heading": "15. CANGBANGAG FALLS",
        "paragraphs": [
          "Last but not least on this list of Siquijor attractions is Cangbangag Falls. Enveloped in lush forests, this waterfall is a breathtaking sight you don’t want to miss, despite the remote location.",
          "You can get there by scooter from Butterfly Sanctuary and, truth be told, it’s easy to get lost while finding it, but the locals will help you once you’re nearby.",
          "I recommend wearing proper shoes as it is about a 20-minute trek to reach the falls. However, the journey is worth it once you get a glimpse of it!",
          "The falls are not crowded, mostly visited by friendly locals, which is a great way to experience this unique spot.",
          "All in all, I highly recommend Cangbangag Falls as one of the Siquijor destinations to add to your itinerary.",
          "Click the button below to view all articles related to the Philippines!"
        ]
      },
      {
        "heading": "FINAL THOUGHTS – SIQUIJOR TOURIST SPOTS",
        "paragraphs": [
          "I hope you enjoyed reading this article and if you have any questions at all about these Siquijor tourist spots, please leave a comment below this post and I will get back to you as soon as I can.",
          "For a quicker response, be sure to join Jonny Melon’s Travel Tribe on Facebook and post your questions or recommendations about these Siquijor things to do to our awesome community."
        ]
      },
      {
        "heading": "TRAVEL RESOURCES FOR YOUR NEXT TRIP",
        "paragraphs": [
          "Whether you’re a seasoned traveler or it’s your first trip overseas, here are some useful travel resources to help you kick-start your next adventure!",
          "Search and book accommodation worldwide.",
          "Compare and book cheap flights to anywhere.",
          "Find tickets, tours, and experiences around the world.",
          "Book buses, trains, and transfers online in advance.",
          "Search all rental cars in your next destination.",
          "Need travel insurance for your next trip?"
        ]
      },
      {
        "heading": "THANKS FOR READING",
        "paragraphs": [
          "Hey friend, thanks for reading this guide about the Siquijor attractions!",
          "Please know this post may contain affiliate links. When making a purchase through one of my links, I earn a small kickback at no extra cost to you and it’s a big help to keep the site up and running. Rest assured, I only promote products and services that I personally use and recommend."
        ]
      },
      {
        "heading": "PIN IT FOR LATER",
        "paragraphs": [
          {
            "type": "list",
            "items": [
              "Share",
              "Tweet",
              "Pin"
            ]
          }
        ]
      }
    ]
  },
  {
    "source": "brokebackpacker",
    "url": "https://www.thebrokebackpacker.com/siquijor-philippines-travel-guide/",
    "title": "Backpacking Siquijor Travel Guide – The Philippines’ Mystical Island (2026)",
    "scraped_at": "2026-01-04T05:54:14.416785",
    "sections": [
      {
        "heading": "Introduction",
        "paragraphs": [
          "Home » Southeast Asia » Philippines » Siquijor",
          "The Broke Backpacker is supported by you. Clicking through our links may earn us a small affiliate commission, and that's what allows us to keep producing free content 🙂 Learn more.",
          "Siquijor is without a doubt one of the most beautiful places I’ve been to in my life. I didn’t know beaches actually looked like this! White sand beaches, insanely clear waters and towering palm trees…  the whole shebang. I had some real pinch-me moments on these beaches.",
          "Not only is Siquijor blessed with pristine beaches but venture inland and you’ll be blessed with lush forests and gushing waterfalls. Whether you want a chill dip in the freshwater pools or the swing into the water from a rope – you can have the best of both worlds.",
          "Although it’s clear there is a unique magic on the island that makes the place undeniably special… there is also a different story about the magic on Siquijor. For years, Siquijor has been avoided by many due to its reputation of being home to witchcraft and black magic.",
          "I was lucky enough to live in Siquijor for a month and got to explore every inch of this beautiful island (above and below the water!). No wizards were found, however, I did find some pretty magical places that I’m excited to share with you.",
          "In this ULTIMATE Siquijor Travel Guide, I’ll unpack all of my wisdom on the top things to do, the best places to stay and how to get around the island. Plus, lots of other tips and tricks along the way.",
          "So, without further ado, let’s get into all the important stuff you need to know before backpacking Siquijor.",
          "The Broke Backpacker is supported by you. Clicking through our links may earn us a small affiliate commission, and that's what allows us to keep producing free content 🙂 Learn more.",
          {
            "type": "list",
            "items": [
              "Why Visit Siquijor Island?",
              "A Sample 3-Day Itinerary for Siquijor",
              "Best Tours in Siquijor",
              "9 Top Things to Do in Siquijor",
              "Where to Stay in Siquijor",
              "Find Your Perfect Stay",
              "Backpacking Siquijor Costs",
              "Best Time to Visit Siquijor",
              "What to Pack for Siquijor",
              "Siquijor Travel Guide to Getting There and Around the Island",
              "Staying Safe in Siquijor",
              "Working and Volunteering in Siquijor",
              "FAQs About Backpacking Siquijor",
              "Final Advice Before Visiting Siquijor"
            ]
          }
        ]
      },
      {
        "heading": "Why Visit Siquijor Island?",
        "paragraphs": [
          "We can’t skip over the island’s undeniable beauty… I mean, you’re travelling to the Philippines! The country is home to some of the most incredible natural wonderlands in the world. Insane beaches, lush forests and some of the kindest people in the world.",
          "Something that surprised me on my visit to Siquijor was the clear influence that the Spanish had on the island. The catholic churches in each town, the colourful buildings and the locals greeting you with “Como Estas” all add to the island’s charm.",
          "The island also had another mysterious charm with its apparent “black magic” practices. Faith healers live on the island and have created a reputation for the island being haunted. This is why – for a long time – the island has not been as popular as staying in Bohol or Cebu.",
          "Most Siquijor neighbourhoods have succumbed to a bit of modernisation, so faith healers have remained on the outskirts. If you want to consult with one, you have to know the right people who just might help you out.",
          "As the island has not been flocked by so many tourists, its beauty has remained intact. Although it is slowly becoming a favourite among local and foreign tourists, Siquijor did not give in to the demands of full modernisation. It maintains its mystique all the while bewitching first-time visitors to return to its turquoise waters and century-old churches.",
          "I encourage you to leave all your apprehensions at home, pack your bags, and allow Isla de Fuego (‘Island of Fire’) to blow you away! And if you’re not quite sold yet… read on, my friend!"
        ]
      },
      {
        "heading": "What Are The Major Attractions in Siquijor?",
        "paragraphs": [
          "Siquijor is a mixed bag of goodness when it comes to things to do. From lush, green forests with flowing waterfalls to rich marine life with beautiful corals – Siquijor is brimming with incredible nature to enjoy. However, not only that – Siquijor is also known for its unique culture and delicious food scene.",
          "I love the saying “No plan is the best plan”… however, sometimes, when you’re travelling with time restrictions, a little bit of a plan can be pretty helpful. These are my can’t-miss activities:",
          {
            "type": "list",
            "items": [
              "Snorkelling at Tubud Marine Sanctuary",
              "Visit Cambugahay Falls (early! This place gets very busy)",
              "Try local Filipino food",
              "Take a ride on a Tricycle",
              "Catch a sunset at the beach",
              "Cliff-jumping at Salagdoong Beach"
            ]
          }
        ]
      },
      {
        "heading": "How Long To Spend in Siquijor?",
        "paragraphs": [
          "The island is relatively small, so you could tick off the main attractions within a few days. However, I’m big on “slow travel“, so I spent a month on the island and I was still finding new places to explore just before I left.",
          "Siquijor is my favourite island in the Philippines, as with so many of the travellers I met. The island really does have a special charm and endless places to explore. Sure, you could do 3 days, but if your itinerary can stretch a couple more, I’d recommend it.",
          "A new country, a new contract, a new piece of plastic – booooring. Instead, buy an eSIM!",
          "Jetpac eSIMs work just like an app: you download it, pick your plan, and BOOM! You’re connected the minute you land. It’s that easy.",
          "Read about how eSIMs work or click below to see one of the top eSIM providers on the market and ditch the plastic."
        ]
      },
      {
        "heading": "A Sample 3-Day Itinerary for Siquijor",
        "paragraphs": [
          "There are so many epic things to do in Siquijor that condensing it down to three days is a challenge, but you know what? You can do it! Three days is enough to see the best of Siquijor… if you plan it right.",
          "Luckily, I’ve put together this iconic 3-Day itinerary for Siquijor to help you make the most of your trip."
        ]
      },
      {
        "heading": "Day 1 in Siquijor – San Juan",
        "paragraphs": [
          "Ahh, your first day in this Filipino paradise. I’d recommend starting your day with a coconut and a dip at Paliton Beach. This beach is gorgeous but it gets bloody busy! So getting there early is the best way to really get to see this beach in all its shining glory.",
          "Next up, I recommend heading to the Lungason Falls. When you arrive, you’ll be greeted by friendly locals who will take your 20 pesos entry fee. Depending on what time you get there, you can either head straight down and enjoy the first waterfall.",
          "Or, if you get there with enough time, I’d recommend asking the kind people at the entrance if you can get a guide to take you on the 12-zodiac waterfall tour. This takes a few hours but is pretty epic! You get to explore the other 11 waterfalls, which you can only do with a guide. The guides are super nice (ours was called Richard) and they take a donation at the end of the tour.",
          "Before you finish the day, don’t miss out on Tubod Marine Sanctuary for some of the best snorkelling in the Philippines. Straight off the beach, you get to explore so much life under the sea! You can rent snorkels here too. If you finish up around sunset, it’s also a cool place to enjoy a beer and the sunset too."
        ]
      },
      {
        "heading": "Day 2 in Siquijor – Lazi",
        "paragraphs": [
          "Day two is centred around activities near Lazi. I’d recommend heading to Cambugahay Falls as early as you can. We arrived just before 8 am (the time it opens) and there were already other tourists waiting to go in.",
          "This place gets PACKED by midday, especially at the weekends, and almost becomes unenjoyable. So I’d recommend arriving before the masses to experience the real beauty of the falls. You could definitely spend a couple of hours here, soaking in the water and enjoying the EPIC rope swing.",
          "Once you’ve enjoyed the falls, you can make a pit stop on your way back into town at Lazi Church and Convent. It won’t take too much time to see these two places, but they will show you a little insight into the religion, culture and history of the island.",
          "I’d finish the day at Salagdoong Beach and enjoy a dose of cliff jumping. Even if you’re not up for the cliff jumping, it’s an ideal spot to finish the day. You can swim, kayak or enjoy a nice meal by the sea. Don’t forget to check the tides for that day, as you won’t be able to jump when the tide is low.",
          "If you have time during day 2, the Enchanted Balete Tree is worth a stop if you’re passing by. This is an attraction for those of you interested in the magic of the island. The base of the tree is home to a spring whose origin is unknown according to locals. You can even buy yourself a mild love potion here!",
          "“Broke but Backpacking” is a WhatsApp community full of passionate travellers. A space to connect with like-minded backpackers and be the first to hear about exclusive deals and giveaways designed just for the community.",
          "If you’re looking for tips, stories, and inspiration for your trip, you should 100%  join the legends in our “Backpacking Southeast Asia” group chat."
        ]
      },
      {
        "heading": "Day 3 in Siquijor – Apo Island",
        "paragraphs": [
          "By day 3, you would’ve managed to have ticked off most of the iconic activities on Siquijor. However, if you have the time and the funds, I’d recommend joining a diving or snorkelling trip to Apo Island. The island is home to some pretty insane marine life and it is a pretty incredible model for sustainable marine conversation.",
          "There are companies all over the island that can organise this for you. Coco Grove Beach Resort can organise snorkelling day trips for approx 2800 pesos ($50 USD) including transport, lunch and snorkelling gear."
        ]
      },
      {
        "heading": "Best Tours in Siquijor",
        "paragraphs": [
          "These are my top picks for the best organised tours that you can take to explore Siquijor:",
          {
            "type": "list",
            "items": [
              "Best of Siquijor Island Tour – 1 Day",
              "Siquijor Healer Experience – 1 Day"
            ]
          }
        ]
      },
      {
        "heading": "9 Top Things to Do in Siquijor",
        "paragraphs": [
          "From cliff jumping and waterfall chasing to lounging on the beach and discovering historic churches – whatever you’re into, there will be something for you on this mystical island.",
          "You’ll want to note down the activities that most interest you and then figure out where you want to base yourself for minimal transport time. Although, I did love the motorbike rides around the island… it is always easiest to base yourself close to your favourite activities.",
          "These were some of my favourite things to do in Siquijor:"
        ]
      },
      {
        "heading": "1. Snorkel at Tubod Marine Sanctuary",
        "paragraphs": [
          "Hidden just behind Coco Grove Resort in San Juan, you’ll find the BEST snorkelling on the island. It’s literally the size of five rugby fields packed with incredible marine life. You could spend hours exploring this underwater paradise. I’ve snorkelled all over Southeast Asia, but this one tops the charts for me. Especially, as it’s just off the beach! Whether you’re learning to snorkel or a free-diving pro, this spot is the best.",
          "Think… sea turtles, incredible coral and THOUSANDS of tropical fish. The entrance fee was 100 pesos ($1.80 USD), and they also hire snorkels and fins for an additional cost.",
          "If you don’t drive around the island, this tour will take you to whatever stops you like on your own customised itinerary. Stop at Tubod Marine Sanctuary and snorkel till your hearts content. Once you’ve explored under the sea, grab a San Miguel beer (the light one was my favourite) and relax on this beautiful white sand beach."
        ]
      },
      {
        "heading": "2. San Isidro Labrador Church and Convent",
        "paragraphs": [
          "More commonly referred to as Lazi Church, the San Isidro Labrador Church is the oldest on Siquijor Island. It has a neoclassical style and is made of sea stones and wood, with its floors still in their original form.",
          "It was declared a National Historic Landmark by the National Historical Commission of the Philippines in 1984 and was recently named a National Cultural Treasure by the National Museum of the Philippines in 2012. Right across from the church is the convent, which now functions as the Siquijor Heritage Museum.",
          "The ground floor has been converted into classrooms, and during our visit, we saw some kids practising for a school presentation. The convent was once the largest in Asia.",
          "There is no entrance fee to visit the church but you’ll be charged an entrance fee of 20 pesos ($0.35 USD) per person for the convent.",
          "It’s a bit of a random stop off, so if you’d like a little more context you can always join an organised tour that combines this and the other main points of interest on the island. Having a local guide show you around always makes these experiences that bit more special. It’s one thing to admire the architecture, but hearing the stories, the legends, and the everyday life behind it all gives the whole experience a bit more depth."
        ]
      },
      {
        "heading": "3. Cambugahay Falls",
        "paragraphs": [
          "From the highway, a 10-minute walk along concrete steps will lead you to Cambugahay Falls, the three-tiered waterfall. You can already see the lowest tier halfway through your descent, and you will be mesmerized by its clear blue waters.",
          "The water level in this area is not deep which is why most visitors enjoy here. There is also a rope tied to a tree for those who want to swing and jump into the water! It’s 50 pesos ($0.90 USD) for unlimited rope swings and is pretty epic to be fair. The entrance fee for Cambugahay Falls is 50 pesos per person.",
          "If you want to know all of the secret spots and some fire pics, definitely go with a local on a tour. It’s also a great way to explore if you don’t drive a scooter and want a more unique experiencing than just hiring a tuktuk driver for the day."
        ]
      },
      {
        "heading": "4. Visit Salagdoong Beach",
        "paragraphs": [
          "Salagdoong Beach may have simple facilities, but whatever it lacks in infrastructure, it makes up for its natural beauty. Anyone who has been here would agree that its water – layers of deep greens and light blues – is the main attraction.",
          "Add to that the cliff jumping area with platforms for 5m and 10m jumps, and you have the best activity for the adrenaline junkies. Salagdoong Beach also has a restaurant, and this is where we had lunch before swimming and admiring the view."
        ]
      },
      {
        "heading": "5. Take a Guided Tour of the 12 Zodiac Waterfalls at Lungason Falls",
        "paragraphs": [
          "Home to the highest rope swing on the island, test your thrill level and see if you’re up for the 9m swing! The local kids can do some pretty cool tricks on it. However, make sure you check that it’s deep enough in the pool first – the first time we were able to do it but the second day we arrived there was a lot less water in the falls, so no swinging that day.",
          "You can also choose to jump off the rocks, these are still pretty high but way more doable! When we arrived, we asked for a guide to take us to the Zodiac Falls. Behind the first one (which is the busy one), there are 11 more stunning waterfalls to climb and explore. Note: you have to have a guide to go beyond the first one.",
          "The guides are super kind and do it on a donation basis – we tipped 500 pesos ($9 USD) for two. Our guide was called Richard and he was awesome."
        ]
      },
      {
        "heading": "6. Visit Paliton Beach",
        "paragraphs": [
          "Paliton Beach is a very beautiful beach in San Juan town and mate, it pops off at sunset. It’s one of the most popular beaches on the island. During my time on Siquijor, I went to so many beaches where you’d hardly see anyone else around… I think it’s because they are all at Paliton Beach.",
          "Although Paliton Beach is beautiful, it was a bit too busy for my liking at this time of day. I’d recommend trying it a bit earlier and catching the sunset at another epic spot on the island.",
          "However, it did have a buzz about it. Everyone enjoying the sunset, beer in hand – that’s always a vibe."
        ]
      },
      {
        "heading": "7. Enchanted Balete Tree",
        "paragraphs": [
          "For those who want to have a taste of Siquijor’s mysterious side, drop by the centuries-old balete tree along the highway of Lazi. What makes this unique from all the other balete trees in the country is the cold spring found at its base, the source of which is unknown according to locals.",
          "Small fishes have made this spring their home, and you can dip your feet into the water for a fish spa. There are also some stalls that sell snacks and souvenirs, including ‘mild’ love potions. The stronger ones, according to a vendor I asked, are only available upon request from faith healers."
        ]
      },
      {
        "heading": "8. Head for Dinner at Roch Cuisine",
        "paragraphs": [
          "We loved this dinner spot and ate here so many times! The restaurant is set up every evening just next to the bridge in San Juan town. The ladies that run the restaurant cook up a storm earlier in the day – you can then select which delicacies you want to try from their silver dishes laid out on a table.",
          "Be sure to get there early(ish) as they stop serving when the food has run out and you don’t want to miss the best part, the sunset view!",
          "Top tip: leave room for dessert, the mango cake is sooo good."
        ]
      },
      {
        "heading": "9. Go Diving or Snorkelling at Apo Island",
        "paragraphs": [
          "Apo Island is one of the best ecotourism destinations in the Philippines! Once threatened by irresponsible fishing practices, which have since ceased, Apo is now a marine success story. The diving here is spectacular and it makes ya feel pretty good knowing that this was all saved because people cared <3",
          "If you want to make life easy for you, then join a tour to see this special island! You get a guide, lunch and pick up so everything is sorted for you. All you gotta do is dive in and start cosplaying mermaids. You even get time to explore the island and if you’re not living your best beach bum life, I definitely recommend the 30-minute trek to the Habagat Trail where you’ll be rewarded with a panoramic view of the coastline and marine sanctuary.",
          "Note that you will need to travel back to Dumaguete port and then arrange a water transfer to get to Apo Island if you plan to stay overnight. If you don’t want to deal with transferring, then talk to a local resort on Siquijor about day trips.",
          "Top tip: Another banger of a place to dive is neighbouring Panglao Island. If you wanna pop over and go diving in Panglao, be sure to hit up Alex — he’s a LEGEND and really knows his stuff… both under AND above water. Just reach out via WhatsApp and let him know I sent you: +44 7812 648968."
        ]
      },
      {
        "heading": "Where to Stay in Siquijor",
        "paragraphs": [
          "There’s good news for backpackers and budget travellers: Siquijor just might be the perfect destination to stay in the Philippines. Budget accommodation is abundant on the island, to the point that most of them are right next to each other. Some are even located along the beach, offering breathtaking views of the sea.",
          "There are so many amazing hotels and hostels in Siquijor. The average price of a hostel stay is between $10-35 USD. But they came stacked with all the amenities you could need and social vibes to meet other travellers. You pay for friends and shared spaces at a hostel, not just the bed!",
          "If you’ve been solo travelling in the Philippines and you’re a bit over the hostel scene – you can find yourself something a bit more private. There are loads of options across both booking.com and Airbnb.",
          "If you want a minimalistic, budget stay you’ll be looking at approx $6-20 USD per night or a mid-range would be more like $20-35 USD per night. Many have air conditioning and even swimming pools!",
          "My top choices of where to stay in Siquijor that are worth checking out are:",
          {
            "type": "list",
            "items": [
              "Best Hotel in Siquijor – Nakabalo Guesthouse & Restaurant",
              "Best Hostel in Siquijor – Fable Hostel",
              "Best Airbnb in Siquijor – Riverside Cabin near Cambugahay Falls",
              "Best Resort in Siquijor – Coco Grove Beach Resort"
            ]
          },
          "If you are willing to splurge on your accommodation, Coco Grove Resort in San Juan town is a popular choice among tourists. It has a private beachfront location (in front of the BEST snorkelling beach on the island – Tubod Marine Sanctuary), three fully-equipped restaurants, and cultural events and activities exclusive to in-house guests only."
        ]
      },
      {
        "heading": "Find Your Perfect Stay",
        "paragraphs": [
          "With millions of trusted reviews, Tripadvisor makes it easy to book the perfect hotel, resort, or rental property — wherever your travels take you."
        ]
      },
      {
        "heading": "The Best Places to Stay in Siquijor",
        "paragraphs": [
          "Are you wondering which is the best part of Siquijor to stay in? Well, let me give you a few suggestions."
        ]
      },
      {
        "heading": "Maria Town",
        "paragraphs": [
          "Not only is Maria Town one of the best places to stay in Siquijor for first-time visitors, but it’s also the ideal destination for travelers who’d like to experience authentic, Filipino-style living!"
        ]
      },
      {
        "heading": "Larena Town",
        "paragraphs": [
          "Traveling on a budget? Then the best area to stay in Siquijor is no doubt Larena Town, a thriving seaport and commercial center."
        ]
      },
      {
        "heading": "San Juan",
        "paragraphs": [
          "Siquijor is a pretty small island, so it doesn’t have a super vibrant night scene like you see in hostels in Cebu or Manila, but San Juan town does have a few bars and nightclubs. I would advise you to visit San Juan during the weekend for a lively ambiance."
        ]
      },
      {
        "heading": "Lazi",
        "paragraphs": [
          "Let’s end our list of best areas to stay in Siquijor with another one of my favorites! Lazi Town is easily among the coolest neighborhoods on the island, mainly because of its unvarnished beauty."
        ]
      },
      {
        "heading": "Siquijor Town",
        "paragraphs": [
          "Surrounded by some of the most beautiful beaches in Siquijor, Siquijor Town is an absolute gem of a place that lends itself super well to families!"
        ]
      },
      {
        "heading": "Backpacking Siquijor Costs",
        "paragraphs": [
          "Siquijor was a little more expensive than I expected. After spending six months across Thailand and Indonesia beforehand, the prices were the highest I’d seen for a while. However, they were still pretty damn affordable compared to my expensive ol’ home in New Zealand…",
          "You know what was super cheap? Beer! The most popular beer on the island was San Miguel which was delicious. If you feel brave enough, you can try your hand at Red Horse… it’s potent. A beer will set you back around 50 pesos a bottle ($0.90 USD)."
        ]
      },
      {
        "heading": "A Daily Budget in Siquijor",
        "paragraphs": [
          "Here is a breakdown of what you’ll likely spend (in USD) as a traveller in Siquijor:"
        ]
      },
      {
        "heading": "A Few Free Things to Do in Siquijor",
        "paragraphs": [
          "Siquijor isn’t the most expensive place to travel however, we Broke Backpackers would do anything to save a few bucks, right? So, in the spirit of sticking to the budget, here are a few free things to do in Siquijor.",
          "Most of Siquijors popular tourist spots still often charge, even as small as 20 pesos ($0.35 USD). But don’t worry, in true backpacker style, I scoped out the best free things to do during my stay.",
          {
            "type": "list",
            "items": [
              "Capilay Spring Water Park – this FREE swimming pool is right in the centre of San Juan and is the ideal spot to cool off in freshwater. The pool is surrounded by shade and there are plenty of benches to chill out and relax on.",
              "San Juan Beach at Sunset – San Juan Beach is so underrated in my opinion. Unless it’s high tide, the beach is not really swimmable. However, it’s the perfect sunset spot if you’re after some peace and quiet. And the best part? It’s absolutely FREE!",
              "Lazi Church – With no entrance fees, Lazi Church is a great free attraction to visit."
            ]
          }
        ]
      },
      {
        "heading": "Top Tips – Travelling Siquijor on a Budget",
        "paragraphs": [
          {
            "type": "list",
            "items": [
              "Eat the Street Delicacies: The weird and wonderful Filipino food that is sold on the street is often delicious and CHEAP. Avoid the overpriced tourist restaurants and go where the locals go.",
              "Sleep on the Couch: Yep, you can couch surf in Siquijor. Get cosy with the friendly locals and crash on their couch. It might be helpful to pack a good travel tent to pitch up instead (it’s always nice to have a little privacy, right?)",
              "Haggle: Get your haggle game on or you’ll often be ripped off. Haggling is fun and totally normal in the Philippines, so give it a go!",
              "Camp: Give camping a go, – hang your backpacking hammock for the night. It’s cost-free, baby!",
              "Cook for yourself: Book a place with a kitchen and save money on going out. Head to the local fruit and veg shop and whip yourself up a meal. You could even pack a good-quality backpacking stove if you can’t find a place with a decent kitchen.",
              "Pack a travel water bottle: Save money – and the planet – every day <3"
            ]
          },
          "When you travel to some of the world’s most remote places, you come to see the full extent of the plastic problem and it’s honestly, really f*cking shocking. It makes you realise the importance of what it means to be a responsible traveller.",
          "The locals on Siquijor really give a shit about the planet. No plastic bags, the beaches were clean and they even closed the beach for any activities for three days a month to let the sea life thrive. It was so refreshing to see! They also have water refill machines at most of the small shops along the roads and only charge a few pesos – use em!",
          "Plus, now you won’t be buying overpriced bottles of water from the supermarkets either – so I guess this is also a budget travel hack! Travel with a filtered water bottle instead and do your bit."
        ]
      },
      {
        "heading": "Best Time to Visit Siquijor",
        "paragraphs": [
          "If you want to experience the true magic of Siquijor, you can either join the “crowds” in the dry season – particularly January and February. Or, you can hold off for the wet season… whaaaat? Yep, that’s right the magic of Siquijor is still pretty incredible even in the rainy season.",
          "Let’s break this down by seasons…",
          {
            "type": "list",
            "items": [
              "Dry Season (November – April): This is when the weather is warm and the downpours are scarce. Expect temperatures of around 30 degrees reaching the mid-thirties on the islands. The hottest months and most humid are March to May when temperatures will reach up to 36 degrees. This is when I visited, and I can confirm it was fuuuuuuuuckin hot – tick that air conditioning filter when looking for Airbnbs… you’re gonna need it.",
              "Wet Season (May – October): ‘Wet Season’ normally puts people off; however, this is a great time to travel to Siquijor. The rains only last around an hour or so before the sun comes back out again. Expect temperatures of around 25 degrees – which is actually a pretty ideal heat for functioning in. Plus, things get cheaper around this time – music to my budget backpacker ears.",
              "Typhoon Season (June – August): I would recommend avoiding this time. The rain becomes much heavier and typhoons are common. Many flights and ferries will be cancelled or face delays which is never ideal."
            ]
          }
        ]
      },
      {
        "heading": "What to Pack for Siquijor",
        "paragraphs": [
          "It’s more than likely that Siquijor is going to present you with a shit load of sunshine and some hot ass days. In these situations, it’s great to have swimmers and breathable clothing with you. The island is not as conservative as some of its other neighbours in Southeast Asia, so you can flaunt a liiiittle more skin.",
          "However, take light cover-up layers. A sarong/ pashmina is perfect for keeping your precious skin from being a bright shade of red. It’s also handy to have if you plan to visit temples or sacred places that often ask you to cover up.",
          "If you’re heading out in the rainy season, it’s always a good idea to pack a good rain jacket. My favourite is the Patagonia Torrentshell jacket. It saved my ass from getting saturated so many times.",
          "If you have your own snorkel, throw it in as it’ll save you money on renting them and it’s just always nice to use your own, right?"
        ]
      },
      {
        "heading": "Ear Plugs",
        "paragraphs": [
          "Snoring dorm-mates can ruin your nights rest and seriously damage the hostel experience. This is why I always travel with a pack of decent ear plugs."
        ]
      },
      {
        "heading": "Hanging Laundry Bag",
        "paragraphs": [
          "Trust us, this is an absolute game changer. Super compact, a hanging mesh laundry bag stops your dirty clothes from stinking, you don’t know how much you need one of these… so just get it, thank us later."
        ]
      },
      {
        "heading": "Sea To Summit Micro Towel",
        "paragraphs": [
          "Hostel towels are scummy and take forever to dry. Microfibre towels dry quickly, are compact, lightweight, and can be used as a blanket or yoga mat if need be."
        ]
      },
      {
        "heading": "Monopoly Deal",
        "paragraphs": [
          "Forget about Poker! Monopoly Deal is the single best travel card game that we have ever played. Works with 2-5 players and guarantees happy days."
        ]
      },
      {
        "heading": "Grayl Geopress Water Bottle",
        "paragraphs": [
          "Always travel with a water bottle! They save you money and reduce your plastic footprint on our planet. The Grayl Geopress acts as a purifier AND temperature regulator. Boom!"
        ]
      },
      {
        "heading": "Siquijor Travel Guide to Getting There and Around the Island",
        "paragraphs": [
          "If you are BALLIN’ out, you can fly to Siquijor on a chartered flight from Cebu Airport. However, for us mere mortals, this is not likely going to be our chosen mode of transport to get to Siquijor.",
          "The main gateway is Dumaguete area, the capital city of nearby Negros Oriental. Siquijor used to be part of this province before it was granted independence on September 17, 1971 – Whoop, go Siquijor!",
          "If coming from the country’s capital Manila, your best choice would be to fly to Dumaguete City. From Dumaguete-Sibulan Airport, hail a tricycle (a ride quite similar to Thailand’s infamous ‘tuk-tuks’) and tell the driver to bring you to the Dumaguete Port or Pier, which is around 15 minutes away. The fare is at least 150 PHP ($2.90 US).",
          "You will be dropped off just outside the port compound’s gate as vehicles aren’t allowed inside. Once inside, proceed to the counters selling ferry tickets.",
          "If you fancy taking your time and staying overnight I can’t recommend one of the many amazing Airbnb’s in Dumaguete enough.",
          "Numerous shipping lines have trips all throughout the day, so buy the ticket for your preferred time. Depending on the type of ferry you will ride, travel time to Siquijor can be as short as 45 minutes or as long as two hours.",
          "Siquijor can also be reached from different points in the Visayas and Mindanao regions. Cebu, Bohol, Dapitan City, and Iligan City are some of the places that provide access to the island.",
          "I departed from Cebu City. I booked my tickets through Oceanjet and headed to Pier One and the process was pretty simple. I would definitely recommend booking tickets online – the ticket counters outside were BUSY. It took around 5 hours to get to Siquijor with one stop in Bohol.",
          "Also, take note that there are two Siquijor ports on the island, Siquijor Town, and Larena. These are two different municipalities, so it’s important to know where your ferry will dock and if it’s close to where you’re planning to stay in Siquijor. You can jump in a tricycle when you arrive – just be sure to haggle for a good price."
        ]
      },
      {
        "heading": "Travelling around Siquijor",
        "paragraphs": [
          "Tricycle is Siquijor’s main mode of transportation. As the country’s third-smallest province measuring only 327 square kilometres, the entire island can be toured in a day, usually by chartered tricycles. For tours around Siquijor’s tourist spots, you may charter a tricycle for at least 1,000 PHP ($21 US).",
          "Based on my experience, all of the tricycle drivers in Siquijor offer tours as this seems to be a huge source of their income. Chances are, your tricycle driver from Siquijor port to the hotel will also offer you his services. And probably a motorbike rental too! The locals are savvy business people, I tell ya.",
          "However, during our time on the island, we rented a motorbike to explore the island ourselves. This was about 250 pesos per day ($4.5 USD) and was a great option! There are some bigger rides on the island. For example, getting from San Juan to Salagdoong Beach can take 45 minutes. There and back, in the heat, can be a big day. So, you may want to use a motorbike for the shorter distances and tricycles for the longer – whatever makes you tick!",
          "Public jeepneys are also over the main highway, but these often only depart when they are full. So, you can be waiting a while before you go anywhere! If you are in a hurry and wouldn’t mind spending a bit more on transportation, then the tricycle is the better option. However, it’s a pretty neat experience."
        ]
      },
      {
        "heading": "Staying Safe in Siquijor",
        "paragraphs": [
          "Despite its reputation for black magic and other spooky things, crime is not a big problem in Siquijor. The island is a pretty safe place to travel. Although, as with anywhere you go, it’s important to keep your wits about ya and travel safely.",
          "Don’t drink and drive, ALWAYS wear a helmet, pack a first aid kit and maybe even pick yourself up a backpacker security belt to keep your cash safe. There are loads of steps that you can take to prevent shit from going wrong."
        ]
      },
      {
        "heading": "Getting Insured BEFORE Visiting Siquijor",
        "paragraphs": [
          "And as many preventative actions we take, shit can still happen. Don’t be silly, get yourself some good travel insurance before you head on your adventure.",
          "ALWAYS sort out your backpacker insurance before your trip. There’s plenty to choose from in that department, but a good place to start is Safety Wing.",
          "They offer month-to-month payments, no lock-in contracts, and require absolutely no itineraries: that’s the exact kind of insurance long-term travellers and digital nomads need.",
          "SafetyWing is cheap, easy, and admin-free: just sign up lickety-split so you can get back to it!",
          "Click the button below to learn more about SafetyWing’s setup or read our insider review for the full tasty scoop."
        ]
      },
      {
        "heading": "Working and Volunteering in Siquijor",
        "paragraphs": [
          "In general, Siquijor isn’t typically a place that ex-pats head to looking for work. That said, I met a TON of Westerners who had retired on the island and a few digital nomads too! The cost of living in the Philippines is pretty low which makes the tropical lifestyle here even more appealing.",
          "A new country, a new contract, a new piece of plastic – booooring. Instead, buy an eSIM!",
          "Jetpac eSIMs work just like an app: you download it, pick your plan, and BOOM! You’re connected the minute you land. It’s that easy.",
          "Read about how eSIMs work or click below to see one of the top eSIM providers on the market and ditch the plastic."
        ]
      },
      {
        "heading": "The Digital Nomad Scene in Siquijor",
        "paragraphs": [
          "To work in the Philippines a work visa is required which must be obtained by an employing company. Despite being popular with digital nomads, there is no digital nomad visa available and most simply enter on long-stay tourist visas.",
          "However, I’m not going to beat around the bush here, the wifi is pretty shocking and the daily power cuts are far from ideal. However, if you can manage a bit of an electricity issue, working remotely from Siquijor can be an absolute dream.",
          "Side note: I’d highly recommend investing in a good head torch to see yourself through the dark times (literally). My go-to is the PETZL ACTIK CORE Headlamp."
        ]
      },
      {
        "heading": "Volunteer in the Siquijor",
        "paragraphs": [
          "Volunteering overseas is an incredible way to immerse yourself in the local culture and sprinkle a bit of good in the world while you do it. Not to mention the free accommodation and other perks that often come along with it…",
          "There’s a wide variety of volunteer projects in the Philippines ranging from teaching English to animal care to agriculture to pretty much anything!",
          "Teaching and cultural exchanges are almost always available to volunteer in to aid community development. Other opportunities include assisting with eco-projects on farms and helping out in hospitality.",
          "There is no special visa to volunteer in the Philippines as long as it’s for less than 90 days, but you’ll have to apply for the appropriate permit to stay long-term.",
          "Worldpackers is our go-to, they connect travellers with host projects. Check out the Worldpackers site and see if they have any opportunities that tickle your fancy in Siquijor before signing up.",
          "Worldpackers: connecting travellers with meaningful travel experiences."
        ]
      },
      {
        "heading": "FAQs About Backpacking Siquijor",
        "paragraphs": [
          "Before you come to Siquijor, you’re likely to have a few burning questions. Luckily, I’ve got answers!"
        ]
      },
      {
        "heading": "What can backpackers do in Siquijor?",
        "paragraphs": [
          "Stay at the many hostel options to mix and mingle. Once you’ve met some travel buddies, you can head off and explore the free (or super low-cost) activities on the island. From beach hopping to waterfall scaling – there is a lot of fun to be had on a shoestring budget."
        ]
      },
      {
        "heading": "How much does 5 days in Siquijor cost?",
        "paragraphs": [
          "If you stay in cheap hostels and cook most of your own food, then five days in Siquijor might only cost you $100 USD. Of course, you can also spend $100 USD on one night of fancier accommodation, so it depends on your expectations of the island."
        ]
      },
      {
        "heading": "Where is the best beachfront accommodation in Siquijor?",
        "paragraphs": [
          "Coco Grove Beach Resort is one of the most popular beachfront resorts on the island and it’s no surprise why. Located on one of the most beautiful beaches on the island, you’ll find Tubod Beach right behind the resort.  Home to the best snorkelling on the island, this resort is perfectly located."
        ]
      },
      {
        "heading": "Final Advice Before Visiting Siquijor",
        "paragraphs": [
          "There are so many beautiful places and islands to visit in the Philippines but let’s not kid ourselves: finding your own island paradise away from the tourists isn’t as easy as it used to be…",
          "Times change, faith healers disappear to village outskirts, and beach resorts take their place. If you want to truly find the magic that remains, you gotta go looking. Enter Siquijor… my favourite island in the Philippines.",
          "A place of dreams, Siquijor will forever hold a special little place in my heart. From discovering incredible underwater worlds and cliff jumping to waterfall sharing and learning more about the mystical healers – this island is packed with epic shit to do.",
          "I hope you found this Siquijor travel guide useful, it was so much fun reminiscing on my time on the island <3 But it’s over and out from me (she says as she opens SkyScanner…. how much are flights to Siquijor…..).",
          "But seriously, have the BEST time exploring this island. Find yourself a healer, buy a strong love potion, and then smuggle it back home to woo your ideal spouse. Now that’s a journey! Adios, Amigo",
          {
            "type": "list",
            "items": [
              "Backpacking Vietnam",
              "How to Find Cheap Flights"
            ]
          },
          {
            "type": "list",
            "items": [
              "Best Party Cities in the World",
              "The Best Travel Fishing Rods"
            ]
          }
        ]
      }
    ]
  },
  {
    "source": "philippineshiddengems",
    "url": "https://philippineshiddengems.com/siquijor-tourist-spots/",
    "title": "17 Amazing Siquijor Tourist Spots You Can’t Miss",
    "scraped_at": "2026-01-04T05:55:28.592545",
    "sections": [
      {
        "heading": "Introduction",
        "paragraphs": [
          "This article may contain affiliate links. This means we receive a small commission whenever you book or purchase something through our links (at no extra cost to you!). You can find more information in our disclaimer.",
          "Siquijor or Isla del Fuego is a small island province located in the Central Visayas region of the Philippines.",
          "I’ve been to this island three times already but each time I visit, this province only gives me more reason to come back.",
          "Siquijor is known for its pristine beaches, rich cultural heritage, welcoming locals, mystical charm, hidden gems, good local foods, and my favorite – no-traffic roads even on the national highway.",
          "In this article, we will explore the 17 amazing tourist spots in Siquijor that you can’t miss in 2025 plus some tips from a local.",
          "Best Beach: Paliton BeachBest Waterfalls: Cambugahay FallsBest Diving Spot: Tulapos Marine SanctuaryBest Historical Structures: Lazi Church and Convent",
          {
            "type": "list",
            "items": [
              "Map of Siquijor Tourist Spots",
              "Siquijor Beaches1. Paliton Beach 🌊2. Salagdoong Beach 🌊3. Kagusuan Beach 🌊4. San Juan Beach 🌊",
              "1. Paliton Beach 🌊",
              "2. Salagdoong Beach 🌊",
              "3. Kagusuan Beach 🌊",
              "4. San Juan Beach 🌊",
              "Siquijor Waterfalls5. Cambugahay Falls 🏞6. Lugnason Falls 🏞7. Lagaan Falls 🏞8. Locong Falls 🏞",
              "5. Cambugahay Falls 🏞",
              "6. Lugnason Falls 🏞",
              "7. Lagaan Falls 🏞",
              "8. Locong Falls 🏞",
              "More Siquijor Attractions9. Cantabon Cave 🪨10. Tulapos Marine Sanctuary 🐟11. Old Enchanted Balete Tree 🌳12. Lazi Church and Convent ⛪13. Siquijor Butterfly Garden 🦋14. Siquijor Marine Sanctuaries 🐟15. Pitogo Cliff 🏞️16. Mount Bandilaan ⛰️17. Siquijor Triangular Landmark 🚩",
              "9. Cantabon Cave 🪨",
              "10. Tulapos Marine Sanctuary 🐟",
              "11. Old Enchanted Balete Tree 🌳",
              "12. Lazi Church and Convent ⛪",
              "13. Siquijor Butterfly Garden 🦋",
              "14. Siquijor Marine Sanctuaries 🐟",
              "15. Pitogo Cliff 🏞️",
              "16. Mount Bandilaan ⛰️",
              "17. Siquijor Triangular Landmark 🚩",
              "BONUS: Healer",
              "Best Time to Visit Siquijor Island",
              "Best Ways to Reach Siquijor⛴️ From Dumaguete⛴️ From Cebu⛴️ From Bohol",
              "⛴️ From Dumaguete",
              "⛴️ From Cebu",
              "⛴️ From Bohol",
              "How to Get Around Siquijor Island?🛵 Motorbike Rental🛺 Tricycle🚙 Tour🚙 Jeepney",
              "🛵 Motorbike Rental",
              "🛺 Tricycle",
              "🚙 Tour",
              "🚙 Jeepney",
              "Where to Stay in Siquijor Island?🛌🏻 Guesthouse: Payag n' Kapitan, Experience pinubre living🛌🏻 Budget Resort: E&N Paradise Island Resort🛌🏻 Mid-range Resort: VILLA MARMARINE BEACH RESORT & RESTAURANT🛌🏻 Luxury Resort:  Coco Grove Beach Resort, Siquijor Island🛌🏻 Glamping Resort: Aquamare Beach Camp Resort",
              "🛌🏻 Guesthouse: Payag n' Kapitan, Experience pinubre living",
              "🛌🏻 Budget Resort: E&N Paradise Island Resort",
              "🛌🏻 Mid-range Resort: VILLA MARMARINE BEACH RESORT & RESTAURANT",
              "🛌🏻 Luxury Resort:  Coco Grove Beach Resort, Siquijor Island",
              "🛌🏻 Glamping Resort: Aquamare Beach Camp Resort",
              "Travel Tips You Should Know Before Going to Siquijor",
              "Frequently Asked Questions",
              "Wrapping-Up: The Best Siquijor Tourist Spots You Should Visit"
            ]
          },
          {
            "type": "list",
            "items": [
              "1. Paliton Beach 🌊",
              "2. Salagdoong Beach 🌊",
              "3. Kagusuan Beach 🌊",
              "4. San Juan Beach 🌊"
            ]
          },
          {
            "type": "list",
            "items": [
              "5. Cambugahay Falls 🏞",
              "6. Lugnason Falls 🏞",
              "7. Lagaan Falls 🏞",
              "8. Locong Falls 🏞"
            ]
          },
          {
            "type": "list",
            "items": [
              "9. Cantabon Cave 🪨",
              "10. Tulapos Marine Sanctuary 🐟",
              "11. Old Enchanted Balete Tree 🌳",
              "12. Lazi Church and Convent ⛪",
              "13. Siquijor Butterfly Garden 🦋",
              "14. Siquijor Marine Sanctuaries 🐟",
              "15. Pitogo Cliff 🏞️",
              "16. Mount Bandilaan ⛰️",
              "17. Siquijor Triangular Landmark 🚩"
            ]
          },
          {
            "type": "list",
            "items": [
              "⛴️ From Dumaguete",
              "⛴️ From Cebu",
              "⛴️ From Bohol"
            ]
          },
          {
            "type": "list",
            "items": [
              "🛵 Motorbike Rental",
              "🛺 Tricycle",
              "🚙 Tour",
              "🚙 Jeepney"
            ]
          },
          {
            "type": "list",
            "items": [
              "🛌🏻 Guesthouse: Payag n' Kapitan, Experience pinubre living",
              "🛌🏻 Budget Resort: E&N Paradise Island Resort",
              "🛌🏻 Mid-range Resort: VILLA MARMARINE BEACH RESORT & RESTAURANT",
              "🛌🏻 Luxury Resort:  Coco Grove Beach Resort, Siquijor Island",
              "🛌🏻 Glamping Resort: Aquamare Beach Camp Resort"
            ]
          }
        ]
      },
      {
        "heading": "Map of Siquijor Tourist Spots",
        "paragraphs": [
          "Before we dive into the details of each tourist spot, let’s take a look at the map of the tourist spots in Siquijor. This map will help you plan your itinerary and navigate the island with ease.",
          "Siquijor is composed of six municipalities, each with its own unique attractions and landmarks. The capital and largest municipality of the province is Siquijor.",
          "Larena is known for its white sand beaches and the Larena Triad. Lazi is home to the San Isidro Labrador Church, a National Historical Landmark.",
          "Maria is known for its Cambugahay Falls and Lugnason Falls. San Juan is known for its Paliton Beach and Tubod Marine Sanctuary.",
          "Enrique Villanueva is known for its Cang-Isok House, a National Historical Landmark."
        ]
      },
      {
        "heading": "Siquijor Beaches",
        "paragraphs": [
          "Siquijor is home to some of the most beautiful beaches in the Philippines, plus a scenic sunset that will leave you in awe. Here are the top 4 Siquijor beaches that you should visit:"
        ]
      },
      {
        "heading": "1. Paliton Beach 🌊",
        "paragraphs": [
          "Paliton Beach is a secluded beach located in San Juan, Siquijor. It is known for its crystal-clear waters, white sand, and stunning sunset views.",
          "The first time I went here was the last day of 2023 and I was so glad that we drove here even though we drove about 24km from our initial point to catch the sunset.",
          "The beach is perfect for swimming and sunbathing. No wonder why I saw a lot of foreign tourists here.",
          "The beach screams calm and serenity in the twilight light. It was truly an enchanting moment to wrap up the year for me.",
          "Sign up now to grab your FREE guide to 50 hidden gems in the Philippines!",
          "To grab your FREE guide to the hidden gems of the Philippines, check your inbox (or maybe your spam folder) and click the link we sent you!"
        ]
      },
      {
        "heading": "2. Salagdoong Beach 🌊",
        "paragraphs": [
          "A popular beach destination in Siquijor, Salagdoong Beach is known for its turquoise waters, white sand, and towering rock formations.",
          "The beach is perfect for swimming, snorkeling, and cliff jumping.",
          "I’ve only been here once during my college year and since that was my exploration days, I’ve tried jumping off the cliff but epically failed to land on the waters properly. My back hurts after that!",
          "Going here, you will pass by the path with lots of molave trees. It was like being transported to another place and the clean air makes it so much better.",
          "Unfortunately, on my second visit, they were doing some renovations so it was close to the public, but it just opened again so tourists can now explore the beach solo or with their loved ones."
        ]
      },
      {
        "heading": "3. Kagusuan Beach 🌊",
        "paragraphs": [
          "Kagusuan Beach is a hidden gem and a premier destination for those who are visiting Siquijor.",
          "It has fine white sand and clear aquamarine waters, tall coconut trees, rock formations dotting different parts, and a vibe of middle-of-nowhere ambiance.",
          "The beach is located along the coastline of Maria, Siquijor southeast part of the island, and is best seen during sunrise, when the sun breaks the darkness of night.",
          "Kagusuan Beach has a rough and charming appeal with its powdery sand, rock formations, and even its rough seas (depending on the season).",
          "The beach may be difficult to get to, but the effort it takes to get there is worth it."
        ]
      },
      {
        "heading": "4. San Juan Beach 🌊",
        "paragraphs": [
          "Can’t get enough of the Siquijor beaches? San Juan Beach is a long stretch of white sand beach located in San Juan, Siquijor.",
          "It is known for its calm waters, beautiful sunset views, and laid-back atmosphere.",
          "A lot of good places to stay in Siquijor can be found here. We even stayed at a budget place around the area that has facility access to another known resort.",
          "The beach is perfect for swimming when high tide, sunbathing, and beach volleyball. There are also a lot of things to do here including snorkeling at Tubod Marine Sanctuary.",
          "It was a bummer that during our entire stay on the island, we didn’t have the chance to swim on any beach that we visited. I know, it was ironic.",
          "📢 Join the community! Make sure you join our Philippines Hidden Gems – Travel Community. This is the place to ask any questions about your trip, to be inspired, and to connect with other Philippines travelers. Click here to join!"
        ]
      },
      {
        "heading": "Siquijor Waterfalls",
        "paragraphs": [
          "Siquijor is also home to some of the most beautiful waterfalls in the Philippines. Here are the top 4 waterfalls or Siquijor falls that you should visit:"
        ]
      },
      {
        "heading": "5. Cambugahay Falls 🏞",
        "paragraphs": [
          "I think Cambugahay Falls is one of the popular Siquijor tourist spots even for first-time time visitors.",
          "This is a three-tiered waterfall located in Lazi, Siquijor, and known for its turquoise waters, natural pools, human drones, and rope swings.",
          "The waterfall is a hidden gem tucked away in the lush green landscape of Siquijor that is perfect for swimming, relaxing, Tarzan swing, and experiencing human drone videos and captures.",
          "It is easily accessible from the main tourist area where visitors can take a dip in the pool, or climb up the tiers and explore the area.",
          "There is a rope swing at the top of the falls for those looking for an adrenaline rush and huge planks floating where you can ask a tour guide to take pictures of you.",
          "I did the rope swing twice on my first visit and on my second visit, my friends and I opted for a group photo at the floating plank.",
          "If you don’t mind the steep stairs that will challenge your lower body strength, this is definitely a must-visit destination on your next Siquijor trip."
        ]
      },
      {
        "heading": "6. Lugnason Falls 🏞",
        "paragraphs": [
          "Lugnason Falls, also known as Zodiac Falls, is a three-tier waterfall located in San Juan, Siquijor Island.",
          "The falls are accessible by scooter, habal-habal, or tricycle, and the trail to the falls is marked and takes around 15 minutes to walk through the forest.",
          "The falls cascade into a crisp and clean teal-green swimming hole and are set in a beautiful rainforest in San Juan province.",
          "The drop is slightly less than 10 meters high, and at the drop’s foot, it forms a pool some 10 meters across.",
          "The falls are full of refreshing crystal blue water, and the walk down from the car park is an easy 10-minute trek, making it completely suitable for all fitness levels.",
          "The entrance fee to Lugnason Falls is free, though you may be asked to pay a small parking fee of 10 pesos.",
          "When you arrive at the Google Maps pin location, you’ll have to park your scooter on the side of the road and head down the trail from here."
        ]
      },
      {
        "heading": "7. Lagaan Falls 🏞",
        "paragraphs": [
          "Still located in the Lazi region on Siquijor Island, Lagaan Falls is a stunning waterfall that is surrounded by a dense rainforest canopy, which makes the hike to the falls more enjoyable.",
          "The trail is marked, and it takes around 15 minutes to walk to the falls. The falls have several features that make them a must-see during your visit including swimming holes, rope swings, rock jumps, and small caves.",
          "The turquoise blue water is also perfect for swimming and the natural slide and rope swing add to the fun. You can visit this hidden gem with an entrance fee of 50 pesos and a parking fee of 10 pesos."
        ]
      },
      {
        "heading": "8. Locong Falls 🏞",
        "paragraphs": [
          "The Lazi municipality has been blessed with an abundance of falls and an addition to this is the Locong Falls.",
          "A small waterfall cascades into a natural blue pool with transparent water and is surrounded by jungle, making it a perfect spot to relax and unwind.",
          "Locong Falls is not a popular waterfall in Siquijor, so you can go at any time of day and not find any other tourists.",
          "We went here after lunch and during our visit, there were only 5 tourists at most each time.",
          "This Siquijor tourist spot is perfect if you want to avoid the crowd and photobombers from the neighboring falls such as the Siquijor Cambugahay Falls and still experience the same thrill and view.",
          "The trail is also easier because it’s not too steep and if you want, a local tour guide can also go with you, and the entrance fee is only Php 50."
        ]
      },
      {
        "heading": "More Siquijor Attractions",
        "paragraphs": [
          "Apart from the Siquijor beaches and waterfalls, Siquijor is also home to other attractions that you should visit. Here are the top 9 attractions that you should visit:"
        ]
      },
      {
        "heading": "9. Cantabon Cave 🪨",
        "paragraphs": [
          "Cantabon Cave is a must-visit destination for tourists in Siquijor. It is a limestone cave located in the central part of the island, in the Barangay of Cantabon.",
          "The cave is known for its natural pools, stalactites, and stalagmites. It is perfect for spelunking and exploring, and it is an adventurous trail inside a pitch-black cave beneath the earth.",
          "Local guides lead visitors into this unique Siquijor tourist spot from a small hole in the ground, local.",
          "Hundreds of stalactites hang from the cave roof, and a stream of fresh water flows through Cantabon Cave, creating natural swimming pools in this underrated destination in Siquijor.",
          "Cantabon Cave is an impressive 800-meter-long cave with an underground river and stunning formations of white rocks, flowstones, columns, stalactites, and stalagmites.",
          "It is a good addition to your Siquijor itinerary as it is one of the most visited tourist destinations in Siquijor Island, Philippines."
        ]
      },
      {
        "heading": "10. Tulapos Marine Sanctuary 🐟",
        "paragraphs": [
          "Tulapos Marine Sanctuary is the oldest marine sanctuary in Siquijor, established in 1986. It covers over 14 hectares of beaches, mangrove forests, coral reefs, and shorelines.",
          "Compared to other marine sanctuaries, Tulapos Marine Sanctuary is home to a diverse range of marine life, including jackfishes, schools of barracudas, sea turtles, giant clams, and sometimes blacktip reef sharks.",
          "You can rent snorkeling gear from the makeshift building at the entrance and pay a fee for snorkeling and a guide.",
          "During high tide, you can swim to the rocky part to start your snorkeling journey to see the barracudas. During low tide, you can walk past the shallow waters.",
          "After the shallow part, you will pass by a rocky portion, so you should be extra careful of the sharp rocks. Aqua shoes are recommended to avoid hurting feet.",
          "The guide will help you to reach the barracudas and in just a few minutes, you can see the jackfishes and barracudas.",
          "On my next visit to Siquijor, this will be my main goal – to visit and swim as many marine sanctuaries as I can fit on my itinerary. Hopefully, I’ll have enough reserve energy by then."
        ]
      },
      {
        "heading": "11. Old Enchanted Balete Tree 🌳",
        "paragraphs": [
          "Other than waterfalls, Lazi, Siquijor also boasts one of Siquijor tourist spots which is The Old Enchanted Balete Tree – a 400-year-old balete tree located in Barangay Campalanas, Lazi.",
          "It is one of the oldest balete trees in the country and is known for its gargantuan size and bizarre looks. The tree has become a popular tourist spot for curious tourists who are visiting Siquijor province.",
          "It is shrouded by lush roadside greenery and has long vines hanging like hair from its outstretched branches.",
          "Some locals believe that the tree is home to mythical and scary creatures, such as kapre and engkanto. The tree is located in a natural spring, and some locals claim to have seen serpents coming from inside the hole.",
          "Visitors can also dip their feet in the water while fish feed on the dead skin of their soles. It’s ticklish at first but you’ll get used to it.",
          "This Siquijor tourist destination also has a souvenir shop where you can buy potions, shirts, caps, amulets, and other accessories."
        ]
      },
      {
        "heading": "12. Lazi Church and Convent ⛪",
        "paragraphs": [
          "The San Isidro Labrador Parish Church or Lazi Church is a Roman Catholic church located in the municipality of Lazi, Siquijor, Philippines.",
          "It was established in 1857 by the Augustinian Recollects and became an independent parish in the same year under the advocacy of Saint Isidore the Laborer.",
          "It is a Baroque-style structure and is among the Baroque Churches of the Philippines list submitted by the National Commission for Culture and the Arts (NCCA) to UNESCO as a candidate for a World Heritage Site.",
          "The church complex is also home to one of the oldest and biggest convents in the country, which was built in 1887.",
          "The design elements are seen in most parts of the structure even though most of the partitions of the convent have been removed.",
          "The church and convent are listed as a National Historical Landmark due to their religious, historical, and architectural importance, not only to the province of Siquijor but to the entire Philippines.",
          "You can also visit this Siquijor tourist attraction before or after visiting Cambugahay Falls or other nearby Siquijor tourist spots."
        ]
      },
      {
        "heading": "13. Siquijor Butterfly Garden 🦋",
        "paragraphs": [
          "Siquijor Butterfly Garden or Siquijor Butterfly Sanctuary is a charming and picturesque butterfly sanctuary located in Cang-apa, Siquijor.",
          "The garden is run by the passionate and friendly owner, Dante Jumapit, who is known for his love and knowledge of butterflies.",
          "We were lucky to get a chance to converse with him during our visit and I was amazed at how passionate he is about this project even though there may be a lot of challenges along the way.",
          "The garden is home to a variety of colorful and gorgeous butterflies that are produced from Jumapit’s butterfly garden.",
          "It is beautifully designed with manicured plants and is maintained in a netted area that allows the butterflies to freely roam.",
          "Although relatively small, the garden is one of the popular Siquijor tourist spots and is often visited by both local and foreign tourists.",
          "Visitors can also take photographs of the beautiful specimens.",
          "The entrance fee is minimal, Php 100, and there is a donation box for those who wish to support the conservation project.",
          "If you’re planning to visit Siquijor, the Butterfly Garden is definitely worth a stop."
        ]
      },
      {
        "heading": "14. Siquijor Marine Sanctuaries 🐟",
        "paragraphs": [
          "Siquijor has several marine sanctuaries that are worth exploring other than Tulapos Marine Sanctuary. One of them is Tubod Marine Sanctuary, located in the town of San Juan.",
          "It is a popular spot for snorkeling and diving, with a wide variety of fish species, corals, and other marine creatures.",
          "The sanctuary is also home to a giant clam nursery, where visitors can see these fascinating creatures up close.",
          "Another popular marine sanctuary in Siquijor is the Caticugan Marine Sanctuary. Located near the northwestern tip of the island, it was legally established in 2003 through Municipal Ordinance 415 – 2003.",
          "This marine sanctuary is managed by the Caticugan Fishers Association and Caticugan Marine Management Council.",
          "Other Siquijor marine sanctuaries that you can visit are Paliton Marine Sanctuary, Talayong Marine Sanctuary, Olang Marine Sanctuary, and Binoongan Marine Sanctuary."
        ]
      },
      {
        "heading": "15. Pitogo Cliff 🏞️",
        "paragraphs": [
          "A newly discovered tourist spot in Siquijor, Pitogo Cliff is a beautiful natural wonder located on the southwestern side of the Island, facing the breathtaking Sulu Sea.",
          "The cliffside gets its name from the Pitogo trees that grow in the area.",
          "For Php 30 entrance fee, the cliff offers a panoramic view of the vast ocean and the endless sky. Visitors can go cliff diving and swim in the sea, or enjoy the view of the area, especially during sunset.",
          "There is a stairway that leads down to the cliff, where visitors can take photos.",
          "However, there are currently no proper railings to hold onto, and the steps might be slippery. So being extra cautious while descending the stairs is advisable.",
          "(UPDATE: The railings are already installed so anyone can reach the edge with ease!)",
          "I didn’t try to descend on my last visit but on my next visit, I’ll definitely go down and try to jump and swim here. Hopefully!"
        ]
      },
      {
        "heading": "16. Mount Bandilaan ⛰️",
        "paragraphs": [
          "Mount Bandilaan is a protected area located in the heart of Siquijor Island.",
          "The park covers an area of approximately 244 hectares and is home to a diverse range of flora and fauna, as well as several cultural and historical landmarks.",
          "It is the highest peak in Siquijor, rising to 557 meters above sea level, and it is perfect for hiking, birdwatching, and taking 360-degree view photos of the island.",
          "If you plan to visit the park, be aware that the road leading to it is steep and some parts of the road are not well-developed.",
          "It is not advisable to visit the park in the late afternoon, especially if you are not used to the place, due to the tall trees along the way and the lack of proper road railing.",
          "It is also not recommended to visit the park during rainy weather, as the road may not be safe and the abundance of moss may cause a slippery journey that may lead to an accident.",
          "Passing Mount Bandilaan Park was my first time driving on a steep road, and this was a memorable experience for me where I can say that I’m proud of my driving skills. 🫣",
          "You’ll know and understand me when you visit this Siquijor tourist spot.",
          "In addition to its natural beauty, Mount Bandilaan is also the source of various medicinal trees and plants used by the traditional or folk healers of the island.",
          "It is also the venue of the famous “Pahi-uli”: Siquijor Healing Festival celebrated during the Holy Week."
        ]
      },
      {
        "heading": "17. Siquijor Triangular Landmark 🚩",
        "paragraphs": [
          "Definitely not the least but the first thing that you see when you arrive in Isla del Fuego.",
          "The Siquijor Triangular Landmark is a triangular-shaped monument located in the town of Siquijor, Siqujor.",
          "Just outside the Siquijor Port, the landmark is made of concrete and is painted in vibrant colors, making it a popular spot for tourists to take photos.",
          "The landmark is also a great place to learn about the history and culture of the island, as there are many informative plaques and signs located around the monument.",
          "If you’re planning a trip to Siquijor, be sure to add the Siquijor Triangular Landmark first thing in your itinerary."
        ]
      },
      {
        "heading": "BONUS: Healer",
        "paragraphs": [
          "Siquijor is also known for its traditional healers or “mananambal” in the local language. These healers use natural remedies and rituals to cure various ailments.",
          "This may not be one of the Siquijor tourist spots mentioned above but this is a great experience to do while you’re in Isla del Fuego.",
          "These healers practice traditional healing methods that have been passed down through generations.",
          "The island’s reputation as a mystical place has attracted many tourists who are interested in the local culture and traditions.",
          "If you’re interested in traditional healing, you can visit one of the healers in Siquijor. The last time we visited the island, we were lucky enough to find a healer on the road. Literally!",
          "We made a stop in the middle of the road and asked the next motorcycle rider who passed by where we could go to find a Siquijor Healer.",
          "What are the chances that we were conversing with one? Mind you, the healer is even the one who supplies the healing potions displayed at the Old Enchanted Balete Tree!",
          "The island’s traditional healers are also known for their ability to perform spiritual healing, which is believed to be effective in treating both physical and emotional illnesses.",
          "The healers gather during Holy Week at the sacred foot of Mt. Bandilaan to celebrate the Folk Healing Festival which showcases the traditional healing methods of the mananambals and is a testament to the island’s rich cultural heritage.",
          "The island’s reputation as the “Island of Witches” dates back to Spanish colonization and trade during the 1660s.",
          "As the main route for trade and merchandise in the Visayas back then, during the voyage of many Spaniards, crew members of the ships started feeling ill and had to drop by to the nearest island.",
          "The Spaniards asked the locals to do all they could to cure their crew.",
          "But upon discovering the Siquijor traditional healing process, the Spaniards distanced themselves from the so-called sorceries and ‘witches,’ and dubbed the island as the ‘Island of Witches’."
        ]
      },
      {
        "heading": "Best Time to Visit Siquijor Island",
        "paragraphs": [
          "The best time to visit the island and explore the Siquijor tourist spots is between November and May, which is the dry season.",
          "The wet season is between June and October, and it is best to avoid visiting during this time as it can be quite rainy.",
          "During the dry season, the weather is hot and sunny, making it perfect for beach activities and island hopping."
        ]
      },
      {
        "heading": "Best Ways to Reach Siquijor",
        "paragraphs": [
          "Siquijor Island can be reached by sea and air, mostly by sea. The nearest airport is the Dumaguete Airport, which is located in Negros Oriental.",
          "There are also several ways to reach Siquijor before exploring the Siquijor tourist spots, depending on your starting point. Here are some of the best ways to get there:"
        ]
      },
      {
        "heading": "⛴️ From Dumaguete",
        "paragraphs": [
          "You can take the fast craft by OceanJet from Dumaguete to Siquijor, the ferry by Montenegro Shipping from Dumaguete to Siquijor, the ferry, and fast craft by Aleson Shipping from Dumaguete to Siquijor, or the new HS Star Marine Shipping Corp. (MV “Anika Star”). If you’re coming from Manila, Dumaguete is also the ideal gateway for you."
        ]
      },
      {
        "heading": "⛴️ From Cebu",
        "paragraphs": [
          "You can take the Oceanjet ferry with a connecting route from Cebu to Tagbilaran, then Siquijor. Alternatively, you can take a ferry from Liloan Port, Cebu to Siquijor. The journey takes around 6 hours before arriving in Siquijor Port, Siquijor.",
          "📢 GOOD NEWS! Starting December 15, 2025, Sunlight Air company will launch its new route from Cebu to Siquijor 4 times a week (Monday, Wednesday, Friday, and Sunday)."
        ]
      },
      {
        "heading": "⛴️ From Bohol",
        "paragraphs": [
          "You can take the Oceanjet ferry from Tagbilaran to Siquijor or the Lite Ferry from Tagbilaran to Larena."
        ]
      },
      {
        "heading": "How to Get Around Siquijor Island?",
        "paragraphs": [
          "Siquijor Island is a beautiful place to explore, and there are many ways to get around and reach every Siquijor tourist spots. Here are some tips on how to get around Siquijor Island:"
        ]
      },
      {
        "heading": "🛵 Motorbike Rental",
        "paragraphs": [
          "Renting a motorbike is the most popular way to get around Siquijor Island. You can rent a motorbike for around PHP 300-500 per day and explore the island at your own pace.",
          "The island is relatively small, but renting a scooter is the best way to get around and explore the mesmerizing waterfalls, clear beaches, and underwater world.",
          "I always choose to drive a motorcycle every time I’m on the island.",
          "Luckily, my college friend owns a motor rental shop and she helps me a lot on where to find off-the-beaten Siquijor tourist spots.",
          "She also went with us on our last visit as a very reliable local tour guide. This made our vacation more memorable and less hassle thinking of where to go next."
        ]
      },
      {
        "heading": "🛺 Tricycle",
        "paragraphs": [
          "Tricycles are another popular mode of transportation on Siquijor Island. They are a bit slower than motorbikes, but they are also cheaper. You can hire a tricycle for around PHP 1,000 per day."
        ]
      },
      {
        "heading": "🚙 Tour",
        "paragraphs": [
          "If you want to see the sights without having to worry about transportation, you can book a Siquijor package tour.",
          "Many tour operators on the island offer tours of the island’s top attractions such as the Old Enchanted Balete Tree, Cambugahay Falls, Salagdoong Beach, and the Lazi Church and Convent."
        ]
      },
      {
        "heading": "🚙 Jeepney",
        "paragraphs": [
          "Jeepneys are a common mode of transportation in the Philippines, and they are also available on Siquijor Island.",
          "They are a bit slower than tricycles, but they are also cheaper. You can hire a jeepney for around PHP 1,500 per day."
        ]
      },
      {
        "heading": "Where to Stay in Siquijor Island?",
        "paragraphs": [
          "Siquijor has a wide range of accommodations to choose from, depending on your budget and preferences. Here are some recommendations:"
        ]
      },
      {
        "heading": "🛌🏻 Guesthouse: Payag n’ Kapitan, Experience pinubre living",
        "paragraphs": [
          "Payag n’ Kapitan is a cozy guesthouse located in Siquijor, Siquijor, and close to Siquijor Port Beach. It offers affordable rooms with basic amenities such as air conditioning, private parking, free breakfast, free Wi-Fi, and an outdoor dining area. The guesthouse also has a garden where you can relax and enjoy the island’s laid-back vibe. This is an ideal place for those who want to stay within proper Siquijor."
        ]
      },
      {
        "heading": "🛌🏻 Budget Resort: E&N Paradise Island Resort",
        "paragraphs": [
          "E&N Paradise Island Resort is a budget-friendly resort located in Sawang, Tubod, San Juan. It offers comfortable rooms with air conditioning, private bathrooms, free parking areas, 24-hour room service, free Wi-Fi, and other amenities. This resort is also a minute away from one of the Siquijor tourist spots which is the Pitogo Cliff."
        ]
      },
      {
        "heading": "🛌🏻 Mid-range Resort: VILLA MARMARINE BEACH RESORT & RESTAURANT",
        "paragraphs": [
          "VILLA MARMARINE BEACH RESORT & RESTAURANT is a mid-range resort owned by a Japanese family located at one part of the beautiful Siquijor beaches, Candanay Sur, Siquijor. It offers spacious rooms with air conditioning, a private bathroom, free Wi-Fi, free breakfast, and a great view of Candanay Sur Beach. The resort also has a restaurant where you can enjoy local and Japanese cuisine."
        ]
      },
      {
        "heading": "🛌🏻 Luxury Resort:  Coco Grove Beach Resort, Siquijor Island",
        "paragraphs": [
          "Coco Grove Beach Resort is a luxury resort located in San Juan, Siquijor. It offers luxurious rooms with air conditioning, private bathroom, and free Wi-Fi. The resort also has restaurants where you can enjoy local and international cuisine. The best part of this resort is the sunset view while sitting on the white sandy beach and sipping your freshly made fruit shake."
        ]
      },
      {
        "heading": "🛌🏻 Glamping Resort: Aquamare Beach Camp Resort",
        "paragraphs": [
          "A 3-star coastal glamping haven located along the beachfront in Siquijor, Aquamare Beach Camp Resort has a relaxing ambiance. This glamping resort offers a delightful escape for guests seeking a blend of peace and adventure. Enjoy the convenience of a private beach, a refreshing swimming pool, and a welcoming restaurant and bar. The resort’s 24-hour front desk ensures attentive service, while free WiFi and private parking add to the comfort. This place is perfect if you want to try glamping without breaking your budget in a quiet area."
        ]
      },
      {
        "heading": "Travel Tips You Should Know Before Going to Siquijor",
        "paragraphs": [
          "💸 Siquijor is a small island, so it’s best to bring enough cash with you. There are only a few ATMs on the island, and they may not always be working. Almost all of the Siquijor tourist spots’ entrance fees are paid in cash.🔒 Isla del Fuego is a safe place to travel, but it’s always best to be cautious. Keep your valuables in a safe place and avoid walking alone at night.👕 Avoid wearing revealing clothing, especially when visiting churches and other religious sites.😎 Siquijor is a tropical island, so it’s best to bring sunscreen, insect repellent, and other essentials. I’m not even sure how many times I applied sunscreen in a day.📱 Consider getting a local SIM card for better communication during your stay but note that some areas don’t have a good reception.✨ Embrace the island’s laid-back vibe and plan a balanced itinerary that includes beach time, cultural visits, and a refreshing stop at Cambugahay Falls."
        ]
      },
      {
        "heading": "Frequently Asked Questions",
        "paragraphs": [
          "All the tourist spots in Siquijor are captivating in their own way, but one of the most captivating tourist spots in Siquijor is Cambugahay Falls, which is a three-tiered waterfall with clear blue waters.",
          "The primary language spoken in Siquijor is Cebuano, with a blend of Filipino and English commonly used for communication. Local dialects and languages may also be spoken among different communities on the island.",
          "Yes! Siquijor is a beautiful island in the Central Visayas region of the Philippines, and it is generally considered safe to travel there alone. However, it is always best to take standard safety precautions when traveling to an unfamiliar place, especially at night",
          "The duration to drive around Siquijor depends on various factors such as traffic, road conditions, and the number of stops you make especially when visiting some Siquijor tourist spots. Generally, it takes around 2 to 3 hours to drive around the island of Siquijor, allowing travelers to explore its beautiful landscapes and attractions at a leisurely pace.",
          "Yes, it’s possible to do a day trip to Siquijor, exploring key attractions like the mystical Balete Tree, beautiful beaches, and the historic Lazi Church. However, to fully appreciate the island’s beauty and culture, consider staying overnight to explore the island deeper into its offerings and experience the ambiance that Siquijor has to offer.",
          "Siquijor was originally called Isla de Fuego or Island of Fire by the Spanish explorers due to the swarming of fireflies at night around molave trees that made them glow. The name has since been associated with the island’s mystic traditions and growing tourism industry."
        ]
      },
      {
        "heading": "Wrapping-Up: The Best Siquijor Tourist Spots You Should Visit",
        "paragraphs": [
          "Siquijor is a beautiful island that is full of surprises. From its pristine beaches to its mystical charm, there’s something for everyone on this island.",
          "If you’re looking for some of the best Siquijor tourist spots, you might want to check out the places mentioned in this article or the Siquijor map with tourist spots for a guide.",
          "These are just a few of the many attractions that Siquijor has to offer. Whether you’re a nature lover, an adventure seeker, or a history buff, there’s always something new to discover on this enchanting island.",
          "So pack your bags, grab your camera, and get ready to explore the best of Siquijor in 2025!"
        ]
      },
      {
        "heading": "🏝️ Travel Resources for Your Siquijor Trip",
        "paragraphs": [
          "Here’s everything you need to book your trip to Siquijor—ferries, places to stay, local transport, and more.How to Get to Siquijor – Book ferry tickets to Siquijor from Dumaguete, Bohol, or Cebu using 12Go, which shows updated routes, schedules, and prices from trusted ferry and flight operators.Where to Book Your Stay – Find beach resorts, guesthouses, and budget hostels in San Juan or Larena through Booking.com, Agoda, Vrbo, or Airbnb, with options for every budget.Getting Around the Island – Rent a motorbike (₱300–₱500/day), hop on a tricycle for short rides or full-day tours, or ask your hotel to arrange private transport for longer routes.Book Tours and Activities – Explore waterfalls, caves, and beaches by booking guided experiences on Klook , GetYourGuide, or Viator, or simply ask locals once you’re on the island.Stay Connected – Use an Airalo eSIM for reliable data, rent pocket WiFi from Klook if you’re in a group, or grab a Globe or Smart SIM card before you arrive.Cash, ATMs, and Payments – Bring enough pesos before heading to the island, as ATMs are limited and card payments are rarely accepted outside major resorts.Travel Insurance – Protect your trip with coverage from SafetyWing, HeyMondo, or World Nomads, especially if you’re riding motorbikes or joining outdoor tours.",
          {
            "type": "list",
            "items": [
              "Siquijor Beaches: A Guide to the 10 Best Beaches in Isla del Fuego",
              "Siquijor Falls: A Guide to the 5 Best Waterfalls on the Island",
              "Siquijor Butterfly Sanctuary: A Hidden Gem for Nature Lovers"
            ]
          },
          {
            "type": "list",
            "items": [
              "Instagram"
            ]
          }
        ]
      },
      {
        "heading": "About the Author",
        "paragraphs": [
          "Hi! I’m Kristine (aka KR). I’m the main developer of Philippine Hidden Gems. My work includes going to places to cover events and places that I’m happy to share with the readers.",
          "Even though I’m an introvert who loves to read and stay indoors all the time, I love to travel outside the country (at least once a year) and nearby regions within PH.",
          "My recent hobbies include learning Japanese culture and exploring the world of K-Pop as a Carat."
        ]
      }
    ]
  },
  {
    "source": "samandkels",
    "url": "https://samandkelsadventures.com/things-to-do-siquijor/",
    "title": "Complete Siquijor Travel Guide for 2025",
    "scraped_at": "2026-01-04T05:56:14.810768",
    "sections": [
      {
        "heading": "Introduction",
        "paragraphs": [
          {
            "type": "list",
            "items": [
              "Jan 30, 2024",
              "Philippines"
            ]
          },
          "There is a unique magic to the island of Siquijor. It’s small and isolated, but not too hard to get to. There’s one road that goes around the whole island, and you can drive it in a day (on a motor-bike of course). The people are very friendly. You always feel safe. And there are a TON of things to do in Siquijor.",
          "While the more touristy islands of Siargao, El Nido, and Coron are bringing in LOADS of tourists from all around the world, Siquijor is the perfect, calm alternative to these other islands. We would say Siquijor and Bohol are where we experienced the most authentic Philippines. (we highly recommend both of them!)",
          "We hope this guide helps you plan your trip to Siquijor!",
          "🇵🇭 Things to Book NOW for Siquijor 👇",
          {
            "type": "list",
            "items": [
              "🏨 Hotel in Siquijor",
              "🛳️ Ferry to/from Bohol",
              "🪽 Safety Wing Travel Insurance"
            ]
          },
          {
            "type": "list",
            "items": [
              "Top 7 Things to Do in Siquijor1 – Cambugahay Falls#2 – Paliton Beach#3 – Lugnason Falls#4 – Visit the Enchanted Balete Tree#5 – Salagdoong Cliff Jump#6 – Quisol Mountain View#7 – Apo Island Boat TourWhere to Stay in SiquijorHow to Get Around in Siquijor PhilippinesHow to get to Siquijor",
              "1 – Cambugahay Falls",
              "#2 – Paliton Beach",
              "#3 – Lugnason Falls",
              "#4 – Visit the Enchanted Balete Tree",
              "#5 – Salagdoong Cliff Jump",
              "#6 – Quisol Mountain View",
              "#7 – Apo Island Boat Tour",
              "Where to Stay in Siquijor",
              "How to Get Around in Siquijor Philippines",
              "How to get to Siquijor",
              "Summary – Things to Do in Siquijor"
            ]
          },
          {
            "type": "list",
            "items": [
              "1 – Cambugahay Falls",
              "#2 – Paliton Beach",
              "#3 – Lugnason Falls",
              "#4 – Visit the Enchanted Balete Tree",
              "#5 – Salagdoong Cliff Jump",
              "#6 – Quisol Mountain View",
              "#7 – Apo Island Boat Tour",
              "Where to Stay in Siquijor",
              "How to Get Around in Siquijor Philippines",
              "How to get to Siquijor"
            ]
          }
        ]
      },
      {
        "heading": "Top 7 Things to Do in Siquijor",
        "paragraphs": [
          "The island of Siquijor is known for witchcraft and faith healing. There are a lot of Filipinos who will not come here because of this.",
          "For example, when we told Kelsey’s mom (who is Filipina) that we were going to Siquijor, she gasped and said “Oh no, aren’t there brujas (witches) there????!!!”",
          "We realized that many Filipinos from other parts of the country misunderstand the nature and magic of the place. Many things to do on this island have roots in witchcraft and healing, but that is not necessarily a bad thing.",
          "Here are our top things to do in Siquor Philippines.",
          "🌴 Book the best Siquijor tours HERE ⬅️"
        ]
      },
      {
        "heading": "1 – Cambugahay Falls",
        "paragraphs": [
          "This is the main tourist spot on the island, and there are TONS of locals who will try to be your guide for a small fee. Be prepared to be mobbed when you pull up in on your motorbike! The guides will want to show you the falls, take pictures as you jump off the platform, watch your stuff, etc.",
          "➡️ Read: The Perfect 2 Week Philippines Itinerary ⛴️"
        ]
      },
      {
        "heading": "#2 – Paliton Beach",
        "paragraphs": [
          "Paliton Beach is a beautiful beach to watch the sunset with the locals after a long day exploring the island. There’s a good mix of locals and tourists here which makes it pretty enjoyable. There are multiple spots get a drink and appreciate the amazing sunset!",
          "➡️ Read: Top 11 Philippines Travel Tips 🇵🇭"
        ]
      },
      {
        "heading": "#3 – Lugnason Falls",
        "paragraphs": [
          "A beautiful waterfall that’s a bit off the beaten path. This one does not get very crowded, and you will need to get a local guide upon arrival to guide you around the falls, take pictures, etc. The local Filipinos have done a good job at monetizing their natural attractions here on the island. (depending on how you view this)",
          "The fee isn’t that much so we highly recommend you come here on your trip around the island!"
        ]
      },
      {
        "heading": "#4 – Visit the Enchanted Balete Tree",
        "paragraphs": [
          "You will pass this tree on your way to the famous attractions on the island, so make sure you stop! There is a man made pool at the bottom where you can receive some free toe cleaning from the fish doctors in the pond.",
          "The large Balete tree is also breath-taking to see up close. We bought a fresh coconut here and enjoyed it before continuing on our road trip around the island!",
          "➡️ Read: The BEST Things to Do in BOHOL 🙉"
        ]
      },
      {
        "heading": "#5 – Salagdoong Cliff Jump",
        "paragraphs": [
          "On your trip around the island you will pass by Salagdoon Beach Resort. The cliff jump is on top of a rock with a height of 10 meters. When we were here the cliff jump was closed because the water was too shallow. If you want to be able to jump you need to be here during high tide.",
          "It did not look that impressive when we came, but we have heard and seen online in videos that it does look quite amazing when the water level is higher!",
          "➡️ Read: Things to Do in EL NIDO 🏝️"
        ]
      },
      {
        "heading": "#6 – Quisol Mountain View",
        "paragraphs": [
          "This is one of the best viewpoints that overlooks the whole island. You can even see Cebu, Negros, and Bohol from here! This is not a crowded tourist spot and is such a breath of fresh air. Look for the sign that says ‘Quesol Mountain View’ on your way to the butterfly park.",
          "🛌 Here are all your hotel options in Siquijor"
        ]
      },
      {
        "heading": "#7 – Apo Island Boat Tour",
        "paragraphs": [
          "Apo Island is a picturesque gem about an hour boat ride from Siquijor, renowned for its stunning natural beauty and vibrant marine life. Located off the southeastern tip of Negros Oriental, this small volcanic island is a popular destination for eco-tourism and underwater enthusiasts.",
          "We did a day trip to Apo Island from Siquijor and it was a great experience! We snorkeled and got to see sea turtles swimming in the ocean alongside us.",
          "Apo Island does not compare to island hopping in Coron or El Nido, but it’s not a bad option for something to do when you come to Siquijor!",
          "🛳️ Checkout the best island-hopping tours in El NIDO HERE! 👈"
        ]
      },
      {
        "heading": "Where to Stay in Siquijor",
        "paragraphs": [
          "Most people stay in the Western part of the island near the port. Since you will need a motorbike when you come to Siquijor, as long as you are somewhere near the port it won’t matter too much where you stay! The most popular hostel in Siquijor is easily Fable Hostel , which has amazing reviews online.",
          "🏨 Checkout all your options in SIQUIJOR here! 👈"
        ]
      },
      {
        "heading": "How to Get Around in Siquijor Philippines",
        "paragraphs": [
          "You are going to want to rent a motorbike. It is not a crowded island, and you are going to be in places where there are not a lot of people. Motor bike is really the only option, unless you want to do an organized tour with a company on the whole island. The beauty of Siquijor is getting lost on your own, and exploring this remote, safe island. (Siquijor is actually where I learned to drive a motorbike for the first time. The calm roads make it a great place to learn!)",
          "When you first arrive at the port on the island, take a tricycle to where you are staying. Then you can probably rent a motorbike from your hotel / hostel. If not, they will surely know where you can find one!"
        ]
      },
      {
        "heading": "How to get to Siquijor",
        "paragraphs": [
          "There are no flights to Siquijor. It is best to take a ferry from Dumaguete (40 min) or Bohol (90 min). Both of these are easy to reach by plane. We were in Moalboal in Cebu before coming here, so we had to take a ferry from the bottom of Cebu (Lilo) to Dumaguete, then another ferry from Dumaguete to Siquijor. Make sure you time them right otherwise you might end up getting stuck in Dumaguete for a night. (Dumaguete is a decently-sized, modern, Filipino city)",
          "🛳️ Ferry from Bohol to Siquijor ($17)",
          "⛴️ Ferry from Dumaguete to Siquijor ($6.89)",
          "**We HIGHLY recommend booking these ferries in advance. We did not do this, and the ferry was sold out when we got to the ticket office, so we had to wait for hours for the next ferry.",
          "💡 TIP: In our 3 Week Philippines Itinerary, we recommend you go from Cebu to Bohol to Siquijor and back to Cebu. (this area is a bit complicated to plan because of all the ferries!) ⛴️"
        ]
      },
      {
        "heading": "Summary – Things to Do in Siquijor",
        "paragraphs": [
          "Siquijor is a wonderful, small, authentic island to visit when you come to The Philippines. We highly recommend you visit this place. We really liked how much quieter Siquijor was in comparison to Siargao, Coron, and El Nido. It really felt like a breath of fresh air, and an authentic look into Filipino culture on a small and beautiful island!",
          "👉 Make sure to checkout out our 2 Week and 3 Week Philippines Itineraries! Also, our guide to visiting Bohol!"
        ]
      }
    ]
  }
]